-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/baseline_characterisitcs.log
  log type:  text
 opened on:  11 May 2023, 10:58:39

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/analysis/extra_ados"

. 
. * SET Index date 
. global indexdate                        = "01/03/2020"

. 
. use "$projectdir/output/data/main", clear

. 
. /*Tables=====================================================================================*/
. *Table 1a - 
. table1_mc, by(drug) total(before) onecol iqrmiddle(",")  ///
>                 vars(age contn %5.1f \ ///
>                         age_group cat %5.1f \ ///       
>                         bmi contn %5.1f \       ///             
>                         bmi_group cat %5.1f \ ///       
>                         bmi_30 bin %5.1f \ ///
>                     sex bin %5.1f \ ///
>                         ethnicity cat %5.1f \ ///
>                         imd cat %5.1f \ ///
>                         region_nhs cat %5.1f \ ///
>                         region_covid_therapeutics cat %5.1f \ ///
>                         stp cat %5.1f \ ///
>                         postest_treat conts %5.1f \     ///     
>                         downs_syndrome bin %5.1f \ ///
>                         solid_cancer bin %5.1f \ ///
>                         haem_disease bin %5.1f \ ///
>                         renal_disease bin %5.1f \ ///
>                         liver_disease bin %5.1f \ ///
>                         imid_on_drug bin %5.1f \ ///
>                         immunosupression bin %5.1f \ ///
>                         hiv_aids bin %5.1f \ ///
>                         solid_organ bin %5.1f \ ///
>                         rare_neuro bin %5.1f \ ///
>                         diabetes bin %5.1f \ ///
>                         chronic_cardiac_disease bin %5.1f \ ///
>                         hypertension bin %5.1f \ ///
>                         chronic_respiratory_disease bin %5.1f \ ///
>                         vaccination_status cat %5.1f \ ///
>                         month_vacc_covid conts %5.1f \ ///
>                         prior_infection  bin %5.1f \ ///
>                         drugs_do_not_use_contra bin %5.1f \ ///
>                         drugs_consider_risk_contra bin %5.1f \ ///
>                         paxlovid_contra bin %5.1f)

  +-----------------------------------------------------------------------------------------------------+
  | factor                           N_T      N_0   N_1   N_2   N_3      m_T      m_0   m_1   m_2   m_3 |
  |-----------------------------------------------------------------------------------------------------|
  | age                           23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | age_group                     23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | bmi                           21,833   21,713    44    38    38    1,482    1,471     6     2     3 |
  |-----------------------------------------------------------------------------------------------------|
  | bmi_group                     21,833   21,713    44    38    38    1,482    1,471     6     2     3 |
  |-----------------------------------------------------------------------------------------------------|
  | bmi_30                        21,833   21,713    44    38    38    1,482    1,471     6     2     3 |
  |-----------------------------------------------------------------------------------------------------|
  | sex                           23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | ethnicity                      9,386    9,336    17    22    11   13,929   13,848    33    18    30 |
  |-----------------------------------------------------------------------------------------------------|
  | imd                           23,083   22,953    50    39    41      232      231     0     1     0 |
  |-----------------------------------------------------------------------------------------------------|
  | region_nhs                    23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | region_covid_therapeutics     23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | stp                           23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | postest_treat                 23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | downs_syndrome                23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | solid_cancer                  23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | haem_disease                  23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | renal_disease                 23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | liver_disease                 23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | imid_on_drug                  23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | immunosupression              23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | hiv_aids                      23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | solid_organ                   23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | rare_neuro                    23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | diabetes                      23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | chronic_cardiac_disease       23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | hypertension                  23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | chronic_respiratory_disease   23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | vaccination_status            23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | month_vacc_covid              22,133   22,008    47    38    40    1,182    1,176     3     2     1 |
  |-----------------------------------------------------------------------------------------------------|
  | prior_infection               23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | drugs_do_not_use_contra       23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | drugs_consider_risk_contra    23,315   23,184    50    40    41        0        0     0     0     0 |
  |-----------------------------------------------------------------------------------------------------|
  | paxlovid_contra               23,315   23,184    50    40    41        0        0     0     0     0 |
  +-----------------------------------------------------------------------------------------------------+
   N_ ... #records used below,   m_ ... #records not used
 
  +----------------------------------------------------------------------------------------------------------------------------------+
  |                                Total             control           sotrovimab        paxlovid          molnupiravir      p-value |
  |----------------------------------------------------------------------------------------------------------------------------------|
  |                                N=23,315          N=23,184          N=50              N=40              N=41                      |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | age                            48.8 (19.0)       48.8 (19.0)       50.8 (21.2)       50.4 (20.8)       53.2 (19.7)        0.38   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | age_group                                                                                                                 0.33   |
  |    18-39                       8,593 (36.9%)     8,554 (36.9%)     19 (38.0%)        12 (30.0%)        8 (19.5%)                 |
  |    40-59                       7,731 (33.2%)     7,680 (33.1%)     16 (32.0%)        16 (40.0%)        19 (46.3%)                |
  |    >=60                        6,991 (30.0%)     6,950 (30.0%)     15 (30.0%)        12 (30.0%)        14 (34.1%)                |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | bmi                            28.3 (7.7)        28.3 (7.7)        26.1 (6.3)        25.9 (8.6)        31.3 (7.6)         0.004  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | bmi_group                                                                                                                 0.017  |
  |    underweight                 2,314 (10.6%)     2,299 (10.6%)     5 (11.4%)         9 (23.7%)         1 ( 2.6%)                 |
  |    normal                      5,233 (24.0%)     5,199 (23.9%)     17 (38.6%)        10 (26.3%)        7 (18.4%)                 |
  |    overweight                  5,493 (25.2%)     5,466 (25.2%)     11 (25.0%)        8 (21.1%)         8 (21.1%)                 |
  |    obese                       8,793 (40.3%)     8,749 (40.3%)     11 (25.0%)        11 (28.9%)        22 (57.9%)                |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | bmi_30                         8,793 (40.3%)     8,749 (40.3%)     11 (25.0%)        11 (28.9%)        22 (57.9%)         0.011  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | sex                            11,925 (51.1%)    11,859 (51.2%)    31 (62.0%)        18 (45.0%)        17 (41.5%)         0.21   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | ethnicity                                                                                                                 0.47   |
  |    Black                       905 ( 9.6%)       902 ( 9.7%)       1 ( 5.9%)         2 ( 9.1%)         0 ( 0.0%)                 |
  |    Mixed                       981 (10.5%)       971 (10.4%)       3 (17.6%)         6 (27.3%)         1 ( 9.1%)                 |
  |    Other                       914 ( 9.7%)       910 ( 9.7%)       1 ( 5.9%)         1 ( 4.5%)         2 (18.2%)                 |
  |    South Asian                 940 (10.0%)       936 (10.0%)       1 ( 5.9%)         1 ( 4.5%)         2 (18.2%)                 |
  |    White                       5,646 (60.2%)     5,617 (60.2%)     11 (64.7%)        12 (54.5%)        6 (54.5%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | imd                                                                                                                       0.62   |
  |    1 least deprived            4,488 (19.4%)     4,458 (19.4%)     10 (20.0%)        8 (20.5%)         12 (29.3%)                |
  |    2                           4,642 (20.1%)     4,617 (20.1%)     14 (28.0%)        4 (10.3%)         7 (17.1%)                 |
  |    3                           4,756 (20.6%)     4,734 (20.6%)     6 (12.0%)         7 (17.9%)         9 (22.0%)                 |
  |    4                           4,576 (19.8%)     4,549 (19.8%)     11 (22.0%)        10 (25.6%)        6 (14.6%)                 |
  |    5 most deprived             4,621 (20.0%)     4,595 (20.0%)     9 (18.0%)         10 (25.6%)        7 (17.1%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | region_nhs                                                                                                                0.69   |
  |    East                        2,353 (10.1%)     2,345 (10.1%)     3 ( 6.0%)         2 ( 5.0%)         3 ( 7.3%)                 |
  |    East Midlands               2,332 (10.0%)     2,316 (10.0%)     4 ( 8.0%)         6 (15.0%)         6 (14.6%)                 |
  |    London                      4,767 (20.4%)     4,736 (20.4%)     12 (24.0%)        12 (30.0%)        7 (17.1%)                 |
  |    North East                  2,344 (10.1%)     2,338 (10.1%)     3 ( 6.0%)         2 ( 5.0%)         1 ( 2.4%)                 |
  |    North West                  2,297 ( 9.9%)     2,288 ( 9.9%)     6 (12.0%)         1 ( 2.5%)         2 ( 4.9%)                 |
  |    South East                  2,366 (10.1%)     2,351 (10.1%)     5 (10.0%)         4 (10.0%)         6 (14.6%)                 |
  |    South West                  2,357 (10.1%)     2,341 (10.1%)     7 (14.0%)         3 ( 7.5%)         6 (14.6%)                 |
  |    West Midlands               2,295 ( 9.8%)     2,282 ( 9.8%)     3 ( 6.0%)         5 (12.5%)         5 (12.2%)                 |
  |    Yorkshire and The Humber    2,204 ( 9.5%)     2,187 ( 9.4%)     7 (14.0%)         5 (12.5%)         5 (12.2%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | region_covid_therapeutics                                                                                                 0.43   |
  |    East                        2,360 (10.1%)     2,345 (10.1%)     9 (18.0%)         5 (12.5%)         1 ( 2.4%)                 |
  |    East Midlands               2,352 (10.1%)     2,333 (10.1%)     10 (20.0%)        6 (15.0%)         3 ( 7.3%)                 |
  |    London                      4,679 (20.1%)     4,653 (20.1%)     7 (14.0%)         9 (22.5%)         10 (24.4%)                |
  |    North East                  2,250 ( 9.7%)     2,238 ( 9.7%)     3 ( 6.0%)         5 (12.5%)         4 ( 9.8%)                 |
  |    North West                  2,358 (10.1%)     2,350 (10.1%)     3 ( 6.0%)         3 ( 7.5%)         2 ( 4.9%)                 |
  |    South East                  2,324 (10.0%)     2,308 (10.0%)     4 ( 8.0%)         4 (10.0%)         8 (19.5%)                 |
  |    South West                  2,283 ( 9.8%)     2,275 ( 9.8%)     3 ( 6.0%)         2 ( 5.0%)         3 ( 7.3%)                 |
  |    West Midlands               2,278 ( 9.8%)     2,264 ( 9.8%)     6 (12.0%)         2 ( 5.0%)         6 (14.6%)                 |
  |    Yorkshire and The Humber    2,431 (10.4%)     2,418 (10.4%)     5 (10.0%)         4 (10.0%)         4 ( 9.8%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | stp                                                                                                                       0.46   |
  |    STP1                        2,344 (10.1%)     2,335 (10.1%)     0 ( 0.0%)         5 (12.5%)         4 ( 9.8%)                 |
  |    STP10                       2,360 (10.1%)     2,346 (10.1%)     4 ( 8.0%)         6 (15.0%)         4 ( 9.8%)                 |
  |    STP2                        2,368 (10.2%)     2,350 (10.1%)     8 (16.0%)         4 (10.0%)         6 (14.6%)                 |
  |    STP3                        2,375 (10.2%)     2,357 (10.2%)     7 (14.0%)         4 (10.0%)         7 (17.1%)                 |
  |    STP4                        2,376 (10.2%)     2,366 (10.2%)     5 (10.0%)         3 ( 7.5%)         2 ( 4.9%)                 |
  |    STP5                        2,358 (10.1%)     2,347 (10.1%)     3 ( 6.0%)         6 (15.0%)         2 ( 4.9%)                 |
  |    STP6                        2,338 (10.0%)     2,326 (10.0%)     7 (14.0%)         3 ( 7.5%)         2 ( 4.9%)                 |
  |    STP7                        2,246 ( 9.6%)     2,236 ( 9.6%)     6 (12.0%)         1 ( 2.5%)         3 ( 7.3%)                 |
  |    STP8                        2,329 (10.0%)     2,310 (10.0%)     5 (10.0%)         7 (17.5%)         7 (17.1%)                 |
  |    STP9                        2,221 ( 9.5%)     2,211 ( 9.5%)     5 (10.0%)         1 ( 2.5%)         4 ( 9.8%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | postest_treat                  3.0 (3.0,3.0)     3.0 (3.0,3.0)     2.0 (1.0,4.0)     2.5 (1.0,4.0)     3.0 (1.0,4.0)     <0.001  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | downs_syndrome                 4,410 (18.9%)     4,385 (18.9%)     7 (14.0%)         8 (20.0%)         10 (24.4%)         0.65   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | solid_cancer                   2,343 (10.0%)     2,332 (10.1%)     4 ( 8.0%)         1 ( 2.5%)         6 (14.6%)          0.29   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | haem_disease                   10,972 (47.1%)    10,905 (47.0%)    20 (40.0%)        26 (65.0%)        21 (51.2%)         0.091  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | renal_disease                  8,041 (34.5%)     7,996 (34.5%)     18 (36.0%)        14 (35.0%)        13 (31.7%)         0.98   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | liver_disease                  4,450 (19.1%)     4,431 (19.1%)     4 ( 8.0%)         9 (22.5%)         6 (14.6%)          0.19   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | imid_on_drug                   6,510 (27.9%)     6,476 (27.9%)     14 (28.0%)        7 (17.5%)         13 (31.7%)         0.48   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | immunosupression               2,282 ( 9.8%)     2,266 ( 9.8%)     7 (14.0%)         5 (12.5%)         4 ( 9.8%)          0.72   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | hiv_aids                       4,447 (19.1%)     4,426 (19.1%)     8 (16.0%)         9 (22.5%)         4 ( 9.8%)          0.40   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | solid_organ                    7,296 (31.3%)     7,258 (31.3%)     13 (26.0%)        11 (27.5%)        14 (34.1%)         0.78   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | rare_neuro                     13,407 (57.5%)    13,341 (57.5%)    22 (44.0%)        26 (65.0%)        18 (43.9%)         0.051  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | diabetes                       2,336 (10.0%)     2,322 (10.0%)     5 (10.0%)         5 (12.5%)         4 ( 9.8%)          0.96   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | chronic_cardiac_disease        2,306 ( 9.9%)     2,299 ( 9.9%)     3 ( 6.0%)         1 ( 2.5%)         3 ( 7.3%)          0.31   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | hypertension                   2,303 ( 9.9%)     2,291 ( 9.9%)     5 (10.0%)         4 (10.0%)         3 ( 7.3%)          0.96   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | chronic_respiratory_disease    2,305 ( 9.9%)     2,299 ( 9.9%)     1 ( 2.0%)         1 ( 2.5%)         4 ( 9.8%)          0.11   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | vaccination_status                                                                                                        0.52   |
  |    Un-vaccinated               4,634 (19.9%)     4,603 (19.9%)     9 (18.0%)         13 (32.5%)        9 (22.0%)                 |
  |    One vaccination             2,378 (10.2%)     2,363 (10.2%)     8 (16.0%)         3 ( 7.5%)         4 ( 9.8%)                 |
  |    Two vaccinations            2,227 ( 9.6%)     2,213 ( 9.5%)     5 (10.0%)         2 ( 5.0%)         7 (17.1%)                 |
  |    Three vaccinations          11,741 (50.4%)    11,678 (50.4%)    24 (48.0%)        20 (50.0%)        19 (46.3%)                |
  |    Four or more vaccinations   2,335 (10.0%)     2,327 (10.0%)     4 ( 8.0%)         2 ( 5.0%)         2 ( 4.9%)                 |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | month_vacc_covid               10.0 (1.0,19.0)   10.0 (1.0,19.0)   4.0 (-4.0,12.0)   8.5 (-3.0,15.0)   6.0 (-5.0,15.5)   <0.001  |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | prior_infection                2,209 ( 9.5%)     2,202 ( 9.5%)     3 ( 6.0%)         2 ( 5.0%)         2 ( 4.9%)          0.45   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | drugs_do_not_use_contra        338 ( 1.4%)       338 ( 1.5%)       0 ( 0.0%)         0 ( 0.0%)         0 ( 0.0%)          0.59   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | drugs_consider_risk_contra     339 ( 1.5%)       339 ( 1.5%)       0 ( 0.0%)         0 ( 0.0%)         0 ( 0.0%)          0.58   |
  |----------------------------------------------------------------------------------------------------------------------------------|
  | paxlovid_contra                12,235 (52.5%)    12,177 (52.5%)    17 (34.0%)        21 (52.5%)        20 (48.8%)         0.069  |
  +----------------------------------------------------------------------------------------------------------------------------------+
Data are presented as mean (SD) or median (IQR) for continuous measures, and n (%) for categorical measures.
 

. 
. 
. *check treatment status*
. count if drug==1&sotrovimab==sotrovimab_not_start
  0

. count if drug==1&sotrovimab==sotrovimab_stopped
  0

. count if drug==2&paxlovid==paxlovid_not_start
  0

. count if drug==2&paxlovid==paxlovid_stopped
  0

. count if drug==3&molnupiravir==molnupiravir_not_start
  0

. count if drug==3&molnupiravir==molnupiravir_stopped
  0

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/baseline_characterisitcs.log
  log type:  text
 closed on:  11 May 2023, 10:58:51
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
