-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_dataset.log
  log type:  text
 opened on:  11 May 2023, 11:02:56

. 
. * import dataset
. import delimited "$projectdir/output/input.csv", clear
(encoding automatically selected: ISO-8859-1)
(199 vars, 50,000 obs)

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/analysis/extra_ados"

. 
. //describe
. //codebook
. 
. *  Convert strings to dates  *
. foreach var of varlist   covid_test_positive_date                               ///
>                                                  covid_test_positive_date2                              ///
>                                                  covid_symptoms_snomed                                  ///     
>                                                  prior_covid_date                                       ///
>                                                  sotrovimab                                                             ///
>                                                  molnupiravir                                                   /// 
>                                                  paxlovid                                                               ///
>                                                  remdesivir                                                             ///
>                                                  casirivimab                                                    ///
>                                                  sotrovimab_not_start                                   ///
>                                                  molnupiravir_not_start                                 ///
>                                                  paxlovid_not_start                                             ///
>                                                  casirivimab_not_start                                  ///
>                                                  remdesivir_not_start                                   ///
>                                                  sotrovimab_stopped                                             ///
>                                                  molnupiravir_stopped                                   ///
>                                                  paxlovid_stopped                                               ///
>                                                  casirivimab_stopped                                    ///
>                                                  remdesivir_stopped                                             ///
>                                                  date_treated                                                   ///
>                                                  drugs_do_not_use                                               ///
>                                                  drugs_consider_risk                                    ///
>                                                  last_vaccination_date                                  ///
>                                                  covid_test_positive_pre_date                   ///
>                                                  death_date                                                             ///
>                                                  dereg_date                                                     ///
>                                                  bmi_date_measured                                              ///
>                                                  creatinine_ctv3_date                                   ///
>                                                  creatinine_snomed_date                                 ///
>                                                  creatinine_short_snomed_date                   ///
>                                                  covid_discharge_date_primary                   ///
>                                                  any_covid_hosp_discharge                               ///                     
>                                                  ae_diverticulitis_icd                                  ///
>                                                  ae_diverticulitis_snomed                               ///
>                                              ae_diarrhoea_snomed                                        ///
>                                                  ae_taste_snomed                                                ///
>                                                  ae_taste_icd                                                   ///
>                                                  ae_anaphylaxis_icd                                             ///
>                                                  ae_anaphylaxis_snomed                                  ///
>                                                  ae_rheumatoid_arthritis_snomed                 ///
>                                                  ae_rheumatoid_arthritis_icd                    ///
>                                                  ae_sle_ctv                                                             ///
>                                                  ae_sle_icd                                                             ///
>                                                  ae_psoriasis_snomed                                    ///
>                                                  ae_psoriatic_arthritis_snomed                  ///
>                                                  ae_ankylosing_spondylitis_ctv                  ///
>                                                  ae_ibd_snomed                                                  ///
>                                                  rheumatoid_arthritis_nhsd_snomed               ///
>                                                  rheumatoid_arthritis_nhsd_icd10                ///
>                                                  sle_nhsd_ctv                                                   ///
>                                                  sle_nhsd_icd10                                                 ///
>                                                  psoriasis_nhsd                                                 ///
>                                                  psoriatic_arthritis_nhsd                               ///
>                                                  ankylosing_spondylitis_nhsd                    ///
>                                                  ibd_ctv                                                                ///
>                                                  all_hosp_date                                                  ///
>                                                  all_hosp_date0                                                 ///
>                                                  all_hosp_date1                                                 ///
>                                                  all_hosp_date2                                                 ///
>                                                  hosp_discharge_date                                    ///
>                                                  hosp_discharge_date0                                   ///
>                                                  hosp_discharge_date1                                   ///
>                                                  hosp_discharge_date2                                   ///
>                                                  covid_hosp_date                                                ///
>                                                  covid_hosp_date_primary                                ///
>                                                  covid_hosp_date0                                               ///
>                                                  covid_hosp_date1                                               ///
>                                                  covid_hosp_date2                                               ///                                             
>                                                  covid_discharge_date0                            ///                                           
>                                                  covid_discharge_date1                                  /// 
>                                                  covid_discharge_date2                                  /// 
>                                                  covid_hosp_date_mabs                                   /// 
>                                                  covid_hosp_date_mabs_not_primary               /// 
>                                                  covid_hosp_date_mabs_day                               ///
>                                                  died_date_ons                                                  ///
>                                                  died_ons_covid {                                        
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(4,999 missing values generated)
(45,000 missing values generated)
(47,684 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(4,999 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(47,500 missing values generated)
(47,500 missing values generated)
(2,500 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(2,500 missing values generated)
(2,500 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(45,000 missing values generated)
(47,500 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(40,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(45,000 missing values generated)
(20,000 missing values generated)
(20,000 missing values generated)

. 
. *check hosp/death event date range*
. codebook covid_test_positive_date date_treated all_hosp_date died_date_ons

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
covid_test_positive_date                                                                                                                                                      (unlabeled)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22626,23141]                 Units: 1
       Or equivalently: [12dec2021,11may2023]         Units: days
         Unique values: 516                       Missing .: 4,999/50,000

                  Mean: 22884.3 = 27aug2022(+ 8 hours)
             Std. dev.: 148.823
           Percentiles:       10%        25%        50%        75%        90%
                            22677      22756      22884      23014      23090
                        01feb2022  21apr2022  27aug2022  04jan2023  21mar2023

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
date_treated                                                                                                                                                                  (unlabeled)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22631,23137]                 Units: 1
       Or equivalently: [17dec2021,07may2023]         Units: days
         Unique values: 452                       Missing .: 0/50,000

                  Mean: 22725.7 = 21mar2022(+ 18 hours)
             Std. dev.:  80.199
           Percentiles:       10%        25%        50%        75%        90%
                            22642      22662      22705      22769      22841
                        28dec2021  17jan2022  01mar2022  04may2022  15jul2022

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
all_hosp_date                                                                                                                                                                 (unlabeled)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22693,23141]                 Units: 1
       Or equivalently: [17feb2022,11may2023]         Units: days
         Unique values: 449                       Missing .: 45,000/50,000

                  Mean: 22916.1 = 28sep2022(+ 2 hours)
             Std. dev.: 130.597
           Percentiles:       10%        25%        50%        75%        90%
                            22736      22803      22915      23032      23096
                        01apr2022  07jun2022  27sep2022  22jan2023  27mar2023

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
died_date_ons                                                                                                                                                                 (unlabeled)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22282,23141]                 Units: 1
       Or equivalently: [02jan2021,11may2023]         Units: days
         Unique values: 860                       Missing .: 20,000/50,000

                  Mean: 22711.6 = 07mar2022(+ 14 hours)
             Std. dev.: 248.228
           Percentiles:       10%        25%        50%        75%        90%
                            22367      22497      22712      22927      23056
                        28mar2021  05aug2021  08mar2022  09oct2022  15feb2023

. 
. 
. ****************************
. *       EXPOSURE                *
. ****************************
. foreach var of varlist sotrovimab molnupiravir paxlovid remdesivir casirivimab{
  2.     display "`var'"
  3.         gen `var'_check = 1 if `var'>=covid_test_positive_date & `var'<=covid_test_positive_date+5 & `var'!=.
  4.         replace `var'_check = 0 if (`var' < covid_test_positive_date | `var' > covid_test_positive_date + 5) & `var'!=.
  5.         sum `var'
  6.         tab `var'_check, m  // should be no 0s
  7.         sum `var'_not_start // number prescribed but not started
  8.         gen `var'_started = 1 if `var'_not_start==. & `var'_check==1
  9.         tab `var'_started, m
 10.         gen `var'_date_started = `var' if `var'==date_treated & `var'_started==1 
 11.         sum `var'_date_started
 12. }
sotrovimab
(49,486 missing values generated)
(44,487 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  sotrovimab |     45,001    22885.54    147.5012      22631      23141

sotrovimab_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,487       88.97       88.97
          1 |        514        1.03       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
sotrovimab~t |      5,000    22886.86    147.4536      22631      23141
(49,533 missing values generated)

sotrovimab_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        467        0.93        0.93
          . |     49,533       99.07      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,901 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
so~e_started |         99    22726.76    85.26802      22632      22981
molnupiravir
(49,533 missing values generated)
(44,534 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
molnupiravir |     45,001    22886.54    147.4426      22631      23141

molnupiravi |
    r_check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,534       89.07       89.07
          1 |        467        0.93       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
molnupirav~t |      5,000     22885.2    146.6546      22631      23141
(49,589 missing values generated)

molnupiravi |
  r_started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        411        0.82        0.82
          . |     49,589       99.18      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,910 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
mo~e_started |         90     22725.8    94.82725      22632      23036
paxlovid
(49,536 missing values generated)
(44,537 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    paxlovid |     45,001    22886.74    147.4782      22631      23141

paxlovid_ch |
        eck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,537       89.07       89.07
          1 |        464        0.93       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_n~t |      5,000    22886.71    147.4398      22631      23141
(49,578 missing values generated)

paxlovid_st |
      arted |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        422        0.84        0.84
          . |     49,578       99.16      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,928 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_d~d |         72    22728.49     85.6738      22632      23035
remdesivir
(49,516 missing values generated)
(44,517 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  remdesivir |     45,001    22887.05    147.2546      22631      23141

remdesivir_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,517       89.03       89.03
          1 |        484        0.97       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
remdesivir~t |      5,000    22886.93    147.3487      22631      23141
(49,563 missing values generated)

remdesivir_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        437        0.87        0.87
          . |     49,563       99.13      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,909 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
re~e_started |         91    22719.35    73.75521      22634      22963
casirivimab
(49,543 missing values generated)
(44,544 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 casirivimab |     45,001    22886.58    147.3996      22631      23141

casirivimab |
     _check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,544       89.09       89.09
          1 |        457        0.91       90.00
          . |      4,999       10.00      100.00
------------+-----------------------------------
      Total |     50,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
casirivima~t |      5,000    22882.66    146.9976      22631      23141
(49,589 missing values generated)

casirivimab |
   _started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        411        0.82        0.82
          . |     49,589       99.18      100.00
------------+-----------------------------------
      Total |     50,000      100.00
(49,908 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ca~e_started |         92    22730.28    78.54282      22631      22912

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(49,901 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(72 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(90 real changes made)

. replace drug=4 if (remdesivir==date_treated & remdesivir_start==1)  | (casirivimab==date_treated & casirivimab==1)
(91 real changes made)

. replace drug=0 if drug==.
(49,649 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir" 4"other", replace

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     49,649       99.30       99.30
  sotrovimab |         99        0.20       99.50
    paxlovid |         71        0.14       99.64
molnupiravir |         90        0.18       99.82
       other |         91        0.18      100.00
-------------+-----------------------------------
       Total |     50,000      100.00

. gen start_date=date_treated if drug>0 
(49,649 missing values generated)

. format start_date %td

. egen median_time = median(date_treated - covid_test_positive_date) if drug>0 & drug<4
(49,740 missing values generated)

. egen median_max = max(median_time)

. sum median_time

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 median_time |        260           3           0          3          3

. replace start_date = covid_test_positive_date + median_max if drug==0
(44,650 real changes made)

. bys drug: count if start_date==. // should be no 0s

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,999
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. *start and end date
. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=start_date+28
(4,999 missing values generated)

. format study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ***Inclusion criteria*
. keep if age>=18 & age<110
(10,640 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(1,965 observations deleted)

. *check covid positive, and not repeat covid test after an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days, m

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,562        199 |     3,761 
         1 |    31,976      1,658 |    33,634 
-----------+----------------------+----------
     Total |    35,538      1,857 |    37,395 

. keep if covid_test_positive==1 & covid_positive_previous_30_days==0
(5,419 observations deleted)

. 
. ***Exclusion criteria*
. *capture and exclude if death or deregistration is on the start date 
. count if start_date>=dereg_date & start_date!=.
  2,837

. count if start_date>=death_date & start_date!=.
  2,855

. drop if start_date>=death_date | start_date>=dereg_date
(8,621 observations deleted)

. 
. 
. ****************************
. *       OUTCOME         *
. ****************************
. 
. *** Primary outcome - AESI
. bys drug: count if ae_rheumatoid_arthritis_icd!=. & (rheumatoid_arthritis_nhsd_snomed==1 | rheumatoid_arthritis_nhsd_icd10==1)

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  869
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  1

. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(19,551 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(19,524 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(19,615 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(19,643 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(19,128 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_nhsd==0
(19,107 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondylitis_nhsd==0
(19,094 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(19,100 missing values generated)

. global ae_spc                   ae_diverticulitis_snomed                ///
>                                                 ae_diarrhoea_snomed                             ///
>                                                 ae_taste_snomed                                         

. global ae_spc_icd               ae_diverticulitis_icd                   ///
>                                                 ae_taste_icd                                    

. global ae_drug                  ae_anaphylaxis_snomed                   

. global ae_drug_icd              ae_anaphylaxis_icd

. global ae_imae                  new_ae_ra_snomed                                ///
>                                                 new_ae_sle_ctv                                  ///
>                                                 new_ae_psoriasis_snomed                 ///
>                                                 new_ae_psa_snomed                               ///
>                                                 new_ae_ankspon_ctv                              ///
>                                                 new_ae_ibd      

. global ae_imae_icd              new_ae_ra_icd                                   ///
>                                                 new_ae_sle_icd                                                  

. *remove event if occurred before start (including new start date for control)
. foreach x in $ae_spc $ae_spc_icd $ae_drug $ae_drug_icd $ae_imae $ae_imae_icd{
  2.                                 display "`x'"
  3.                                 bys drug: count if (`x' < start_date | `x' > start_date + 28) & `x'!=.
  4.                                 replace `x'=. if (`x' < start_date | `x' > start_date + 28) & `x'!=.
  5. }
ae_diverticulitis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,339
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  9
(4,373 real changes made, 4,373 to missing)
ae_diarrhoea_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,386
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  11
(4,418 real changes made, 4,418 to missing)
ae_taste_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,331
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  12
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  10
(4,364 real changes made, 4,364 to missing)
ae_diverticulitis_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,415
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  15
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  11
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  8
(4,456 real changes made, 4,456 to missing)
ae_taste_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,368
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  5
(4,391 real changes made, 4,391 to missing)
ae_anaphylaxis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,398
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  8
(4,423 real changes made, 4,423 to missing)
ae_anaphylaxis_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,370
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  8
(4,408 real changes made, 4,408 to missing)
new_ae_ra_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,603
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  6
(3,631 real changes made, 3,631 to missing)
new_ae_sle_ctv

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,497
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  8
(3,525 real changes made, 3,525 to missing)
new_ae_psoriasis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,985
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  10
(4,026 real changes made, 4,026 to missing)
new_ae_psa_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,004
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  7
(4,033 real changes made, 4,033 to missing)
new_ae_ankspon_ctv

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,003
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  11
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  7
(4,036 real changes made, 4,036 to missing)
new_ae_ibd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,011
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  14
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  10
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  7
(4,051 real changes made, 4,051 to missing)
new_ae_ra_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,599
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  6
(3,625 real changes made, 3,625 to missing)
new_ae_sle_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,510
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  9
(3,534 real changes made, 3,534 to missing)

. egen ae_spc_gp = rmin($ae_spc)
(22,618 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(22,887 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd)
(22,160 missing values generated)

. egen ae_drug_gp = rmin($ae_drug)
(23,100 missing values generated)

. egen ae_drug_serious = rmin($ae_drug_icd)
(23,104 missing values generated)

. egen ae_drug_all = rmin($ae_drug $ae_drug_icd)
(22,852 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)        
(22,149 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(22,971 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd)  
(21,783 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_drug $ae_drug_icd $ae_imae $ae_imae_icd)
(20,243 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_drug_icd $ae_imae_icd)
(22,266 missing values generated)

. by drug, sort: count if ae_spc_all!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,184
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if ae_drug_all!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  501
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  1

. by drug, sort: count if ae_imae_all!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,564
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  2

. by drug, sort: count if ae_all!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,091
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. 
. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. by drug, sort: count if covid_hosp_date!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,328
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  5

. by drug, sort: count if covid_hosp_date0!=. // *nb: control group will not have covid_hosp_date0 - as do not have date_treated

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,310
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. // covid admission is the same date as date treated 
. by drug, sort: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&date_treated!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,305
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. by drug, sort: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!=.&date_treated!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,320
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  4

. // covid admission is the same date as date treated and is a daycase
. by drug, sort: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&covid_hosp_date0==covid_discharge_date0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&covid_hosp_date1==covid_discharge_date1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&(covid_discharge_date0 - covid_hosp_date0)==1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&(covid_discharge_date1 - covid_hosp_date1)==1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is PM but discharged in AM 
. count if covid_hosp_date!=.&covid_discharge_date_primary==.
  2,123

. count if covid_hosp_date==.&covid_discharge_date_primary!=.
  2,161

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date==covid_discharge_date_primary
  0

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date<covid_discharge_date_primary
  124

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date>covid_discharge_date_primary
  102

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.  // [? Bang is your code for this correct~line 135]
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting all hosp admission: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. by drug, sort: count if all_hosp_date!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,286
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  6

. by drug, sort: count if all_hosp_date0!=. // *nb: control group will not have covid_hosp_date0 - as do not have date_treated

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,338
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. // admission is the same date as date treated 
. by drug, sort: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_treated!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,337
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. by drug, sort: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&date_treated!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,330
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  3

. // admission is the same date as date treated and is a daycase
. by drug, sort: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0-all_hosp_date0)==1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1-all_hosp_date1)==1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is PM but discharged in AM 
. count if all_hosp_date!=.&hosp_discharge_date==.
  2,084

. count if all_hosp_date==.&hosp_discharge_date!=.
  2,160

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharge_date
  1

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge_date
  108

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge_date
  111

. // REPLACE - ignore admission if admission it is the day 0 or day 1 after treatment date AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. // Decision not to REPLACE admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. 
. foreach var of varlist covid_hosp_date all_hosp_date died_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' < start_date | `var' > start_date + 28) & `var'!=.                            
  4.                                 replace `var'=. if (`var' < start_date | `var' > start_date + 28) & `var'!=.
  5. }
covid_hosp_date

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,217
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  5
(2,238 real changes made, 2,238 to missing)
all_hosp_date

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,160
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  6
(2,178 real changes made, 2,178 to missing)
died_date_ons

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  13,379
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  28
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  24
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  21
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  26
(13,478 real changes made, 13,478 to missing)

. 
. *** Secondary outcome - severe drug reactions (including DRESS, SJS, TEN, anaphylaxis) 
. 
. ****************************
. *       COVARIATES              *
. ****************************
. by drug,sort: tab high_risk_cohort_covid_therapeut,m

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |      2,353       10.15       10.15
                    HIV or AIDS |      1,178        5.08       15.23
                           IMID |      2,273        9.80       25.03
              IMID,solid cancer |      2,451       10.57       35.61
                             NA |      1,166        5.03       40.64
        haematological diseases |      1,165        5.03       45.66
    haematological malignancies |      1,195        5.15       50.82
                  liver disease |      1,139        4.91       55.73
    primary immune deficiencies |      2,376       10.25       65.98
                  renal disease |      2,276        9.82       75.79
            sickle cell disease |      2,194        9.46       85.26
                   solid cancer |      2,274        9.81       95.07
stem cell transplant recipients |      1,144        4.93      100.00
--------------------------------+-----------------------------------
                          Total |     23,184      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          2        4.00        4.00
                    HIV or AIDS |          5       10.00       14.00
                           IMID |          2        4.00       18.00
              IMID,solid cancer |          6       12.00       30.00
                             NA |          2        4.00       34.00
        haematological diseases |          5       10.00       44.00
    haematological malignancies |          1        2.00       46.00
                  liver disease |          5       10.00       56.00
    primary immune deficiencies |          8       16.00       72.00
                  renal disease |          3        6.00       78.00
            sickle cell disease |          7       14.00       92.00
stem cell transplant recipients |          4        8.00      100.00
--------------------------------+-----------------------------------
                          Total |         50      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          4       10.00       10.00
                    HIV or AIDS |          1        2.50       12.50
                           IMID |          5       12.50       25.00
              IMID,solid cancer |          6       15.00       40.00
                             NA |          2        5.00       45.00
        haematological diseases |          3        7.50       52.50
    haematological malignancies |          1        2.50       55.00
                  liver disease |          1        2.50       57.50
    primary immune deficiencies |          3        7.50       65.00
                  renal disease |          7       17.50       82.50
            sickle cell disease |          2        5.00       87.50
                   solid cancer |          5       12.50      100.00
--------------------------------+-----------------------------------
                          Total |         40      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          4        9.76        9.76
                    HIV or AIDS |          2        4.88       14.63
                           IMID |          3        7.32       21.95
              IMID,solid cancer |          5       12.20       34.15
                             NA |          3        7.32       41.46
        haematological diseases |          3        7.32       48.78
    haematological malignancies |          2        4.88       53.66
                  liver disease |          4        9.76       63.41
    primary immune deficiencies |          5       12.20       75.61
                  renal disease |          3        7.32       82.93
            sickle cell disease |          2        4.88       87.80
                   solid cancer |          3        7.32       95.12
stem cell transplant recipients |          2        4.88      100.00
--------------------------------+-----------------------------------
                          Total |         41      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |          5       12.50       12.50
                           IMID |          1        2.50       15.00
              IMID,solid cancer |          1        2.50       17.50
                             NA |          2        5.00       22.50
        haematological diseases |          4       10.00       32.50
    haematological malignancies |          3        7.50       40.00
                  liver disease |          2        5.00       45.00
    primary immune deficiencies |          6       15.00       60.00
                  renal disease |          6       15.00       75.00
            sickle cell disease |          6       15.00       90.00
                   solid cancer |          3        7.50       97.50
stem cell transplant recipients |          1        2.50      100.00
--------------------------------+-----------------------------------
                          Total |         40      100.00


. gen downs_syndrome_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "Downs syndrome")
(20,987 missing values generated)

. gen solid_cancer_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "solid cancer")
(18,601 missing values generated)

. gen haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "haematological malignancies")
(22,153 missing values generated)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "sickle cell disease")
(2,211 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "haematological diseases")
(1,180 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "stem cell transplant")
(1,151 real changes made)

. gen renal_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "renal disease")
(21,060 missing values generated)

. gen liver_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "liver disease")
(22,204 missing values generated)

. gen imid_on_drug_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "IMID")
(18,602 missing values generated)

. gen immunosupression_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "primary immune deficiencies")
(20,957 missing values generated)

. gen hiv_aids_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "HIV or AIDS")
(22,169 missing values generated)

. gen solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "solid organ recipients")
(23,355 missing values generated)

. replace solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "solid organ transplant")
(0 real changes made)

. gen rare_neuro_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "rare neurological conditions")
(23,355 missing values generated)

. *check if all diseases have been captured*
. by drug,sort: count if high_risk_cohort_covid_therapeut!=""&high_risk_cohort_covid_therapeut!="other"& min(downs_syndrome_therapeutics,solid_cancer_therapeutics,haem_disease_therapeut
> ics,renal_disease_therapeutics,liver_disease_therapeutics,imid_on_drug_therapeutics,immunosupression_therapeutics,hiv_aids_therapeutics,solid_organ_therapeutics,rare_neuro_therapeutic
> s)==.

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,166
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  2

. tab high_risk_cohort_covid_therapeut if high_risk_cohort_covid_therapeut!=""&high_risk_cohort_covid_therapeut!="other"& min(downs_syndrome_therapeutics,solid_cancer_therapeutics,haem_
> disease_therapeutics,renal_disease_therapeutics,liver_disease_therapeutics,imid_on_drug_therapeutics,immunosupression_therapeutics,hiv_aids_therapeutics,solid_organ_therapeutics,rare_
> neuro_therapeutics)==.

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                             NA |      1,175      100.00      100.00
--------------------------------+-----------------------------------
                          Total |      1,175      100.00

. 
. *clean eligible
. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  230

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0
  190

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0 &imid_on_drug==1
  98

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0 &imid_on_drug==1 &down
> s_syndrome==0 &solid_cancer==0 &haem_disease==0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &solid_organ_transplant==0 &rare_neuro==0
  5

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imid_drug_hcd==0 
  5,110

. // REPLACE - ignore eligible steriods<4 scripts in last 6m
. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
(230 real changes made)

. replace imid_drug_all=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0
(0 real changes made)

. // REPLACE - ignore eligible if not coded for imid AND (imid_drug or drug_HCD) & if <4 scripts steriod
. replace imid_on_drug=0 if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imid_drug_hcd==0 
(5,110 real changes made)

. gen eligible_clean=((downs_syndrome + solid_cancer + haem_disease + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids + solid_organ_transplant + rare_neuro )>
> 0)

. rename solid_organ_transplant solid_organ

. tab eligible_clean eligible

eligible_c |       eligible
      lean |         0          1 |     Total
-----------+----------------------+----------
         0 |       493        231 |       724 
         1 |         0     22,631 |    22,631 
-----------+----------------------+----------
     Total |       493     22,862 |    23,355 

. count if high_risk_cohort_covid_therapeut=="" & eligible_clean==1
  0

. count if high_risk_cohort_covid_therapeut!="" & eligible_clean==0
  724

. 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro {
  2.         replace `var'_therapeutics=0 if `var'_therapeutics==.
  3.         display `var'
  4.         tab `var'_therapeutics `var'
  5.         gen `var'_all = 1 if `var'==1 | `var'_therapeutics==1
  6. }
(20,987 real changes made)
1

downs_synd |
rome_thera |    downs_syndrome
   peutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,016      3,971 |    20,987 
         1 |     1,922        446 |     2,368 
-----------+----------------------+----------
     Total |    18,938      4,417 |    23,355 
(17,016 missing values generated)
(18,601 real changes made)
0

solid_canc |
er_therape |     solid_cancer
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,721      1,880 |    18,601 
         1 |     4,289        465 |     4,754 
-----------+----------------------+----------
     Total |    21,010      2,345 |    23,355 
(16,721 missing values generated)
(17,611 real changes made)
0

haem_disea |
se_therape |     haem_disease
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,333      8,278 |    17,611 
         1 |     3,032      2,712 |     5,744 
-----------+----------------------+----------
     Total |    12,365     10,990 |    23,355 
(9,333 missing values generated)
(21,060 real changes made)
1

renal_dise |
ase_therap |     renal_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,790      7,270 |    21,060 
         1 |     1,512        783 |     2,295 
-----------+----------------------+----------
     Total |    15,302      8,053 |    23,355 
(13,790 missing values generated)
(22,204 real changes made)
0

liver_dise |
ase_therap |     liver_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,972      4,232 |    22,204 
         1 |       928        223 |     1,151 
-----------+----------------------+----------
     Total |    18,900      4,455 |    23,355 
(17,972 missing values generated)
(18,602 real changes made)
0

imid_on_dr |
ug_therape |     imid_on_drug
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |    13,407      5,195 |    18,602 
         1 |     3,430      1,323 |     4,753 
-----------+----------------------+----------
     Total |    16,837      6,518 |    23,355 
(13,407 missing values generated)
(20,957 real changes made)
0

immunosupr |
ession_the |   immunosupression
 rapeutics |         0          1 |     Total
-----------+----------------------+----------
         0 |    18,893      2,064 |    20,957 
         1 |     2,176        222 |     2,398 
-----------+----------------------+----------
     Total |    21,069      2,286 |    23,355 
(18,893 missing values generated)
(22,169 real changes made)
0

hiv_aids_t |
herapeutic |       hiv_aids
         s |         0          1 |     Total
-----------+----------------------+----------
         0 |    17,954      4,215 |    22,169 
         1 |       944        242 |     1,186 
-----------+----------------------+----------
     Total |    18,898      4,457 |    23,355 
(17,954 missing values generated)
(23,355 real changes made)
1

solid_orga |
n_therapeu |      solid_organ
      tics |         0          1 |     Total
-----------+----------------------+----------
         0 |    16,047      7,308 |    23,355 
-----------+----------------------+----------
     Total |    16,047      7,308 |    23,355 
(16,047 missing values generated)
(23,355 real changes made)
0

rare_neuro |
_therapeut |      rare_neuro
       ics |         0          1 |     Total
-----------+----------------------+----------
         0 |     9,923     13,432 |    23,355 
-----------+----------------------+----------
     Total |     9,923     13,432 |    23,355 
(9,923 missing values generated)

. // decision to use primary care variable for identification of high risk rather than CMU as not present for ocontrol group
. 
. *Time between positive test and treatment*
. gen postest_treat=start_date-covid_test_positive_date

. tab postest_treat,m

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         31        0.13        0.13
          1 |         25        0.11        0.24
          2 |         34        0.15        0.39
          3 |     23,206       99.36       99.75
          4 |         27        0.12       99.86
          5 |         32        0.14      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. by drug, sort: tab postest_treat 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     23,184      100.00      100.00
------------+-----------------------------------
      Total |     23,184      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         12       24.00       24.00
          1 |          8       16.00       40.00
          2 |         10       20.00       60.00
          3 |          5       10.00       70.00
          4 |          4        8.00       78.00
          5 |         11       22.00      100.00
------------+-----------------------------------
      Total |         50      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       17.50       17.50
          1 |          6       15.00       32.50
          2 |          7       17.50       50.00
          3 |          5       12.50       62.50
          4 |          7       17.50       80.00
          5 |          8       20.00      100.00
------------+-----------------------------------
      Total |         40      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5       12.20       12.20
          1 |          7       17.07       29.27
          2 |          4        9.76       39.02
          3 |          7       17.07       56.10
          4 |         10       24.39       80.49
          5 |          8       19.51      100.00
------------+-----------------------------------
      Total |         41      100.00

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       17.50       17.50
          1 |          4       10.00       27.50
          2 |         13       32.50       60.00
          3 |          5       12.50       72.50
          4 |          6       15.00       87.50
          5 |          5       12.50      100.00
------------+-----------------------------------
      Total |         40      100.00


. replace postest_treat=. if postest_treat<0|postest_treat>7
(0 real changes made)

. gen postest_treat_cat=(postest_treat>=3) if postest_treat<=5

. replace postest_treat_cat=9 if postest_treat_cat==. 
(0 real changes made)

. label define postest_treat_cat 0 "<3 days" 1 "3-5 days"  9 "missing", replace 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |     23,355    48.76656     19.0157         18        108

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |      8,609       36.86       36.86
      40-59 |      7,741       33.14       70.01
       >=60 |      7,005       29.99      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |      2,542       10.88       10.88
        25- |      2,013        8.62       19.50
        30- |      2,000        8.56       28.07
        35- |      2,054        8.79       36.86
        40- |      1,719        7.36       44.22
        45- |      2,008        8.60       52.82
        50- |      2,115        9.06       61.88
        55- |      1,899        8.13       70.01
        60- |      1,640        7.02       77.03
        65- |      1,451        6.21       83.24
        70- |      1,445        6.19       89.43
        75- |        994        4.26       93.68
        80- |        722        3.09       96.78
        85- |        753        3.22      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. * Sex
. gen male = 1 if sex == "M"
(11,946 missing values generated)

. replace male = 0 if sex == "F"
(11,946 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(11,946 missing values generated)

. replace sex=1 if sex_str=="F"
(11,946 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     13,948       59.72       59.72
      Black |        907        3.88       63.61
      Mixed |        984        4.21       67.82
      Other |        917        3.93       71.74
South Asian |        941        4.03       75.77
      White |      5,658       24.23      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(13,948 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(13,948 real changes made)

. gen White=1 if ethnicity==5
(17,697 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(3,749 real changes made)

. gen White_with_missing=White
(13,948 missing values generated)

. replace White_with_missing=9 if White==.
(13,948 real changes made)

. * IMD
. tab imd,m

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        232        0.99        0.99
          1 |      4,625       19.80       20.80
          2 |      4,589       19.65       40.45
          3 |      4,764       20.40       60.84
          4 |      4,651       19.91       80.76
          5 |      4,494       19.24      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. replace imd=. if imd==0
(232 real changes made, 232 to missing)

. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so high is more deprived)
(18359 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived", replace

. label values imd imd

. gen imd_with_missing=imd
(232 missing values generated)

. replace imd_with_missing=9 if imd==.
(232 real changes made)

. tab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |      4,494       19.44       19.44
               2 |      4,651       20.11       39.55
               3 |      4,764       20.60       60.15
               4 |      4,589       19.85       80.00
 5 most deprived |      4,625       20.00      100.00
-----------------+-----------------------------------
           Total |     23,123      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,356       10.09       10.09
           East Midlands |      2,335       10.00       20.09
                  London |      4,773       20.44       40.52
              North East |      2,349       10.06       50.58
              North West |      2,301        9.85       60.43
              South East |      2,370       10.15       70.58
              South West |      2,359       10.10       80.68
           West Midlands |      2,302        9.86       90.54
Yorkshire and The Humber |      2,210        9.46      100.00
-------------------------+-----------------------------------
                   Total |     23,355      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      2,364       10.12       10.12
           East Midlands |      2,357       10.09       20.21
                  London |      4,686       20.06       40.28
              North East |      2,256        9.66       49.94
              North West |      2,359       10.10       60.04
              South East |      2,328        9.97       70.01
              South West |      2,289        9.80       79.81
           West Midlands |      2,281        9.77       89.57
Yorkshire and The Humber |      2,435       10.43      100.00
-------------------------+-----------------------------------
                   Total |     23,355      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,349       10.06       10.06
      STP10 |      2,365       10.13       20.18
       STP2 |      2,372       10.16       30.34
       STP3 |      2,380       10.19       40.53
       STP4 |      2,378       10.18       50.71
       STP5 |      2,362       10.11       60.83
       STP6 |      2,340       10.02       70.85
       STP7 |      2,248        9.63       80.47
       STP8 |      2,334        9.99       90.46
       STP9 |      2,227        9.54      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Other"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |      2,349       10.06       10.06
      STP10 |      2,365       10.13       20.18
       STP2 |      2,372       10.16       30.34
       STP3 |      2,380       10.19       40.53
       STP4 |      2,378       10.18       50.71
       STP5 |      2,362       10.11       60.83
       STP6 |      2,340       10.02       70.85
       STP7 |      2,248        9.63       80.47
       STP8 |      2,334        9.99       90.46
       STP9 |      2,227        9.54      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
         bmi |  26.53698  21.52006  27.37062  33.00377 -4.134847  58.34344
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(1,486 real changes made, 1,486 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*10 & (age+((bmi_date_measured-start_date)/365)>=18)
(1,979 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 & (age+((bmi_date_measured-start_date)/365)>=18)
(1,979 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 & (age+((bmi_date_measured-start_date)/365)>=18)
(6,000 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(1,486 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(1,486 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(1,486 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(1,486 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(1,486 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,016       89.99       89.99
          1 |      2,339       10.01      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,041       90.09       90.09
          1 |      2,314        9.91      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,045       90.11       90.11
          1 |      2,310        9.89      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,046       90.11       90.11
          1 |      2,309        9.89      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |      2,337       10.01       10.01
          One vaccination |      2,383       10.20       20.21
       Three vaccinations |     11,760       50.35       70.56
         Two vaccinations |      2,234        9.57       80.13
            Un-vaccinated |      2,382       10.20       90.33
 Un-vaccinated (declined) |      2,259        9.67      100.00
--------------------------+-----------------------------------
                    Total |     23,355      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination_status_g=="Un-vaccinated (declined)"
(18,714 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(2,383 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(2,234 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(11,760 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinations"
(2,337 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(9,258 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(9,258 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(1,183 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -413           -513
 5%         -288           -508
10%         -187           -506       Obs              22,172
25%          7.5           -505       Sum of wgt.      22,172

50%          273                      Mean           274.9213
                        Largest       Std. dev.      344.7827
75%          545           1054
90%          738           1058       Variance       118875.1
95%          839           1061       Skewness       .0083667
99%          967           1064       Kurtosis       2.157799

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(1,183 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -17 |          1        0.00        0.00
        -16 |         26        0.11        0.12
        -15 |         71        0.30        0.42
        -14 |         88        0.38        0.80
        -13 |        155        0.66        1.46
        -12 |        173        0.74        2.20
        -11 |        227        0.97        3.17
        -10 |        251        1.07        4.25
         -9 |        284        1.22        5.46
         -8 |        301        1.29        6.75
         -7 |        364        1.56        8.31
         -6 |        380        1.63        9.94
         -5 |        393        1.68       11.62
         -4 |        501        2.15       13.77
         -3 |        468        2.00       15.77
         -2 |        539        2.31       18.08
         -1 |        595        2.55       20.63
          0 |        579        2.48       23.10
          1 |        638        2.73       25.84
          2 |        672        2.88       28.71
          3 |        627        2.68       31.40
          4 |        627        2.68       34.08
          5 |        610        2.61       36.69
          6 |        677        2.90       39.59
          7 |        576        2.47       42.06
          8 |        589        2.52       44.58
          9 |        613        2.62       47.21
         10 |        619        2.65       49.86
         11 |        613        2.62       52.48
         12 |        612        2.62       55.10
         13 |        619        2.65       57.75
         14 |        639        2.74       60.49
         15 |        595        2.55       63.04
         16 |        569        2.44       65.47
         17 |        654        2.80       68.27
         18 |        599        2.56       70.84
         19 |        630        2.70       73.53
         20 |        541        2.32       75.85
         21 |        547        2.34       78.19
         22 |        499        2.14       80.33
         23 |        469        2.01       82.34
         24 |        462        1.98       84.32
         25 |        403        1.73       86.04
         26 |        350        1.50       87.54
         27 |        327        1.40       88.94
         28 |        311        1.33       90.27
         29 |        305        1.31       91.58
         30 |        222        0.95       92.53
         31 |        164        0.70       93.23
         32 |        145        0.62       93.85
         33 |        128        0.55       94.40
         34 |         86        0.37       94.77
         35 |         34        0.15       94.91
         36 |          5        0.02       94.93
          . |      1,183        5.07      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3              0
 5%           24              0
10%           50              0       Obs              23,355
25%          128              0       Sum of wgt.      23,355

50%          258                      Mean           257.6871
                        Largest       Std. dev.      149.4632
75%          387            515
90%          464            515       Variance       22339.24
95%          491            515       Skewness      -.0050785
99%          510            515       Kurtosis       1.800669

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         62        0.27        0.27
          1 |      1,413        6.05        6.32
          2 |      1,307        5.60       11.91
          3 |      1,358        5.81       17.73
          4 |      1,348        5.77       23.50
          5 |      1,347        5.77       29.27
          6 |      1,343        5.75       35.02
          7 |      1,333        5.71       40.72
          8 |      1,371        5.87       46.59
          9 |      1,371        5.87       52.46
         10 |      1,375        5.89       58.35
         11 |      1,332        5.70       64.05
         12 |      1,332        5.70       69.76
         13 |      1,362        5.83       75.59
         14 |      1,366        5.85       81.44
         15 |      1,388        5.94       87.38
         16 |      1,341        5.74       93.12
         17 |      1,386        5.93       99.06
         18 |        220        0.94      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. mkspline calendar_day_spline = day_after_campaign, cubic nknots(4)

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,345       69.99       69.99
          1 |      2,330        9.98       79.96
          9 |      2,367       10.13       90.10
          . |      2,313        9.90      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,345       69.99       69.99
          1 |      2,382       10.20       80.18
          9 |      2,318        9.93       90.11
          . |      2,310        9.89      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |      2,373       10.16       10.16
   B.1.617.2 |     16,359       70.04       80.21
VOC-21JAN-02 |      4,623       19.79      100.00
-------------+-----------------------------------
       Total |     23,355      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |     1,668     11,441      3,236 |    16,345 
 confirmed SGTF |       221      1,681        480 |     2,382 
             NA |       250      1,605        463 |     2,318 
              . |       234      1,632        444 |     2,310 
----------------+---------------------------------+----------
          Total |     2,373     16,359      4,623 |    23,355 

. * Prior infection
. gen prior_infection=(covid_test_positive_pre_date<=(covid_test_positive_date-30) & covid_test_positive_pre_date >mdy(1,1,2020) & covid_test_positive_pre_date!=.)

. tab prior_infection,m

prior_infec |
       tion |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,145       90.54       90.54
          1 |      2,210        9.46      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. *Contraindications for Pax*
. tab drug if solid_organ==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      7,258       99.32       99.32
  sotrovimab |         13        0.18       99.49
    paxlovid |         11        0.15       99.64
molnupiravir |         14        0.19       99.84
       other |         12        0.16      100.00
-------------+-----------------------------------
       Total |      7,308      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      2,285       99.43       99.43
  sotrovimab |          2        0.09       99.52
    paxlovid |          7        0.30       99.83
molnupiravir |          3        0.13       99.96
       other |          1        0.04      100.00
-------------+-----------------------------------
       Total |      2,298      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      7,996       99.29       99.29
  sotrovimab |         18        0.22       99.52
    paxlovid |         14        0.17       99.69
molnupiravir |         13        0.16       99.85
       other |         12        0.15      100.00
-------------+-----------------------------------
       Total |      8,053      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vaccine-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,313        9.90        9.90
          < |      1,166        4.99       14.90
         <= |      1,205        5.16       20.06
          = |     15,298       65.50       85.56
          > |      1,142        4.89       90.45
         >= |      1,112        4.76       95.21
          ~ |      1,119        4.79      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.03439  47.97994  58.97672   69.4968         0  118.7992
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_ctv3_date>start_date
(11,477 real changes made, 11,477 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.08869  49.96891  59.82876  70.12186  20.20585  118.7992
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      1,179        9.93        9.93
          < |        582        4.90       14.83
         <= |        624        5.25       20.08
          = |      7,821       65.84       85.92
          > |        561        4.72       90.65
         >= |        525        4.42       95.07
          ~ |        586        4.93      100.00
------------+-----------------------------------
      Total |     11,878      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(11,878 real changes made)

. gen min_creatinine_ctv3=.
(23,355 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(6,106 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(5,772 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(3,277 real changes made)

. gen max_creatinine_ctv3=.
(23,355 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(6,106 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(5,772 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(20,078 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(11,610 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(6,041 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,361       10.11       10.11
          < |      1,139        4.88       14.99
         <= |      1,173        5.02       20.01
          = |     15,321       65.60       85.61
          > |      1,093        4.68       90.29
         >= |      1,182        5.06       95.35
          ~ |      1,086        4.65      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,361       10.11       10.11
          < |      1,139        4.88       14.99
         <= |      1,173        5.02       20.01
          = |     15,321       65.60       85.61
          > |      1,093        4.68       90.29
         >= |      1,182        5.06       95.35
          ~ |      1,086        4.65      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
cre~e_snomed |  22.57465         0         0  45.17871  -44.4533  120.7818
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(17,597 real changes made, 17,597 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(creatinine_snomed)
(11,740 real changes made, 2,904 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if missing(creatinine_snomed)
(9,784 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creatinine_snomed)
(17,393 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_snomed)
(17,597 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(13,701 real changes made, 13,701 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(9,654 real changes made)

. gen min_creatinine_snomed=.
(23,355 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(4,996 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(4,658 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(1,320 real changes made)

. gen max_creatinine_snomed=.
(23,355 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(4,996 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(4,658 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(22,035 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*(0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snomed<=120
(13,820 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(4,937 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,345       10.04       10.04
          < |      1,140        4.88       14.92
         <= |      1,190        5.10       20.02
          = |     15,177       64.98       85.00
          > |      1,176        5.04       90.04
         >= |      1,164        4.98       95.02
          ~ |      1,163        4.98      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      2,338       10.01       10.01
          < |      1,116        4.78       14.79
         <= |      1,220        5.22       20.01
          = |     15,128       64.77       84.79
          > |      1,164        4.98       89.77
         >= |      1,171        5.01       94.78
          ~ |      1,218        5.22      100.00
------------+-----------------------------------
      Total |     23,355      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egfr_record>0&egfr_operator!=">"
> &egfr_operator!=">=")|(egfr_short_record<60&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(20,328 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egfr_record>0&egfr_operator!=">"
> &egfr_operator!=">=")|(egfr_short_record<30&egfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(22,657 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,014       99.57       99.57
  sotrovimab |          5        0.17       99.74
    paxlovid |          2        0.07       99.80
molnupiravir |          5        0.17       99.97
       other |          1        0.03      100.00
-------------+-----------------------------------
       Total |      3,027      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        695       99.57       99.57
    paxlovid |          1        0.14       99.71
molnupiravir |          1        0.14       99.86
       other |          1        0.14      100.00
-------------+-----------------------------------
       Total |        698      100.00

. *drug interactions*
. tab drug if drugs_do_not_use<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        621      100.00      100.00
-------------+-----------------------------------
       Total |        621      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        621      100.00      100.00
-------------+-----------------------------------
       Total |        621      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        546      100.00      100.00
-------------+-----------------------------------
       Total |        546      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        338      100.00      100.00
-------------+-----------------------------------
       Total |        338      100.00

. tab drug if drugs_consider_risk<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        631      100.00      100.00
-------------+-----------------------------------
       Total |        631      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        631      100.00      100.00
-------------+-----------------------------------
       Total |        631      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        553      100.00      100.00
-------------+-----------------------------------
       Total |        553      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |        339      100.00      100.00
-------------+-----------------------------------
       Total |        339      100.00

. gen drugs_do_not_use_contra=(drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180))  // Are these CI drug for paxlovid only??

. gen drugs_consider_risk_contra=(drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contra = 1 if egfr_30==1 | dialysis==1
(20,370 missing values generated)

. replace paxlovid_contra = 1 if liver_disease==1 
(3,898 real changes made)

. replace paxlovid_contra = 1 if solid_organ==1 
(5,198 real changes made)

. replace paxlovid_contra = 1 if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)
(173 real changes made)

. recode paxlovid_contra . = 0
(11101 changes made to paxlovid_contra)

. by drug, sort: count if paxlovid_contra==1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  12,177
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  17
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  21
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  20
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  19

. 
. 
. ****************************
. *       COX MODEL               *
. ****************************
. drop if drug==4 // removing those on casirivimab or remdesivir as first drug after covid test
(40 observations deleted)

. rename covid_hosp_date covid_hosp

. rename all_hosp_date all_hosp

. rename died_date_ons died

. 
. * Generate failure 
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae_anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed ///
>                                            new_ae_psa_snomed new_ae_ankspon_ctv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         display "`var'"
  3.         by drug, sort: count if `var'!=.
  4.         by drug, sort: count if `var'<start_date & `var' 
  5.         replace `var'=. if `var'<start_date & `var'!=.
  6.         gen fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==1
  7.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==2
  8.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, paxlovid_d, remdesivir_d, casirivimab_d)) if drug==3
  9.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==0
 10.         tab drug fail_`var', m
 11. }
ae_spc_gp

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  731
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |    fail_ae_spc_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,454        730 |    23,184 
  sotrovimab |        48          2 |        50 
    paxlovid |        37          3 |        40 
molnupiravir |        40          1 |        41 
-------------+----------------------+----------
       Total |    22,579        736 |    23,315 
ae_spc_serious

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  463
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |  fail_ae_spc_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,721        463 |    23,184 
  sotrovimab |        48          2 |        50 
    paxlovid |        38          2 |        40 
molnupiravir |        40          1 |        41 
-------------+----------------------+----------
       Total |    22,847        468 |    23,315 
ae_spc_all

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,184
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  2

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,001      1,183 |    23,184 
  sotrovimab |        46          4 |        50 
    paxlovid |        35          5 |        40 
molnupiravir |        39          2 |        41 
-------------+----------------------+----------
       Total |    22,121      1,194 |    23,315 
ae_imae_gp

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,199
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |    fail_ae_imae_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,985      1,199 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        38          2 |        40 
molnupiravir |        38          3 |        41 
-------------+----------------------+----------
       Total |    22,110      1,205 |    23,315 
ae_imae_serious

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  383
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_imae_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,801        383 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    22,932        383 |    23,315 
ae_imae_all

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,564
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    21,620      1,564 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        38          2 |        40 
molnupiravir |        38          3 |        41 
-------------+----------------------+----------
       Total |    21,745      1,570 |    23,315 
ae_all

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3,091
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    20,094      3,090 |    23,184 
  sotrovimab |        44          6 |        50 
    paxlovid |        33          7 |        40 
molnupiravir |        36          5 |        41 
-------------+----------------------+----------
       Total |    20,207      3,108 |    23,315 
ae_all_serious

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,082
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |  fail_ae_all_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,102      1,082 |    23,184 
  sotrovimab |        48          2 |        50 
    paxlovid |        38          2 |        40 
molnupiravir |        40          1 |        41 
-------------+----------------------+----------
       Total |    22,228      1,087 |    23,315 
ae_diverticulitis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  253
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,932        252 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        40          1 |        41 
-------------+----------------------+----------
       Total |    23,061        254 |    23,315 
ae_diarrhoea_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  265
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,919        265 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,049        266 |    23,315 
ae_taste_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  220
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,964        220 |    23,184 
  sotrovimab |        48          2 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,092        223 |    23,315 
ae_diverticulitis_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  230
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,954        230 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,083        232 |    23,315 
ae_taste_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  235
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,949        235 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        40          1 |        41 
-------------+----------------------+----------
       Total |    23,077        238 |    23,315 
ae_anaphylaxis_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  250
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_anaphylaxis_i
             |          cd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,934        250 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,065        250 |    23,315 
ae_anaphylaxis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  254
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_ae_anaphylaxis_s
             |         nomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,930        254 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,060        255 |    23,315 
new_ae_ra_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  200
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,984        200 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,115        200 |    23,315 
new_ae_sle_ctv

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  186
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,998        186 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,128        187 |    23,315 
new_ae_psoriasis_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  198
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,986        198 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        38          3 |        41 
-------------+----------------------+----------
       Total |    23,114        201 |    23,315 
new_ae_psa_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  213
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,971        213 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        39          1 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,101        214 |    23,315 
new_ae_ankspon_ctv

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  224
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,960        224 |    23,184 
  sotrovimab |        49          1 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,090        225 |    23,315 
new_ae_ibd_snomed

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  204
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,980        204 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,111        204 |    23,315 
new_ae_ra_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  179
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    23,005        179 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,136        179 |    23,315 
new_ae_sle_icd

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  205
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,979        205 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,110        205 |    23,315 
covid_hosp

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  111
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |    fail_covid_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    23,073        111 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,204        111 |    23,315 
all_hosp

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  126
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |     fail_all_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    23,058        126 |    23,184 
  sotrovimab |        50          0 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    23,189        126 |    23,315 
died

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  476
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(23,265 missing values generated)
(40 real changes made)
(41 real changes made)
(23,184 real changes made)

             |       fail_died
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |    22,709        475 |    23,184 
  sotrovimab |        48          2 |        50 
    paxlovid |        40          0 |        40 
molnupiravir |        41          0 |        41 
-------------+----------------------+----------
       Total |    22,838        477 |    23,315 

. * Add half-day buffer if outcome on indexdate
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae_anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed ///
>                                            new_ae_psa_snomed new_ae_ankspon_ctv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         display "`var'"
  3.         replace `var'=`var'+0.5 if `var'==start_date
  4. }
ae_spc_gp
(29 real changes made)
ae_spc_serious
(20 real changes made)
ae_spc_all
(49 real changes made)
ae_imae_gp
(56 real changes made)
ae_imae_serious
(8 real changes made)
ae_imae_all
(64 real changes made)
ae_all
(134 real changes made)
ae_all_serious
(37 real changes made)
ae_diverticulitis_snomed
(6 real changes made)
ae_diarrhoea_snomed
(17 real changes made)
ae_taste_snomed
(6 real changes made)
ae_diverticulitis_icd
(8 real changes made)
ae_taste_icd
(12 real changes made)
ae_anaphylaxis_icd
(9 real changes made)
ae_anaphylaxis_snomed
(12 real changes made)
new_ae_ra_snomed
(7 real changes made)
new_ae_sle_ctv
(6 real changes made)
new_ae_psoriasis_snomed
(12 real changes made)
new_ae_psa_snomed
(10 real changes made)
new_ae_ankspon_ctv
(13 real changes made)
new_ae_ibd_snomed
(8 real changes made)
new_ae_ra_icd
(5 real changes made)
new_ae_sle_icd
(3 real changes made)
covid_hosp
(1 real change made)
all_hosp
(8 real changes made)
died
(17 real changes made)

. *Generate censor date
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd ae_anaphylaxis_icd ae_anaphylaxis_snomed new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed ///
>                                            new_ae_psa_snomed new_ae_ankspon_ctv new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         gen stop_`var'=`var' if fail_`var'==1
  3.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==1
  4.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==2
  5.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==3
  6.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==0
  7.         format %td stop_`var'
  8. }
(22,579 missing values generated)
(48 real changes made)
(37 real changes made)
(40 real changes made)
(22,454 real changes made)
(22,847 missing values generated)
(48 real changes made)
(38 real changes made)
(40 real changes made)
(22,721 real changes made)
(22,121 missing values generated)
(46 real changes made)
(35 real changes made)
(39 real changes made)
(22,001 real changes made)
(22,110 missing values generated)
(49 real changes made)
(38 real changes made)
(38 real changes made)
(21,985 real changes made)
(22,932 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(22,801 real changes made)
(21,745 missing values generated)
(49 real changes made)
(38 real changes made)
(38 real changes made)
(21,620 real changes made)
(20,207 missing values generated)
(44 real changes made)
(33 real changes made)
(36 real changes made)
(20,094 real changes made)
(22,228 missing values generated)
(48 real changes made)
(38 real changes made)
(40 real changes made)
(22,102 real changes made)
(23,061 missing values generated)
(50 real changes made)
(39 real changes made)
(40 real changes made)
(22,932 real changes made)
(23,049 missing values generated)
(50 real changes made)
(39 real changes made)
(41 real changes made)
(22,919 real changes made)
(23,092 missing values generated)
(48 real changes made)
(39 real changes made)
(41 real changes made)
(22,964 real changes made)
(23,083 missing values generated)
(49 real changes made)
(39 real changes made)
(41 real changes made)
(22,954 real changes made)
(23,077 missing values generated)
(49 real changes made)
(39 real changes made)
(40 real changes made)
(22,949 real changes made)
(23,065 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(22,934 real changes made)
(23,060 missing values generated)
(49 real changes made)
(40 real changes made)
(41 real changes made)
(22,930 real changes made)
(23,115 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(22,984 real changes made)
(23,128 missing values generated)
(50 real changes made)
(39 real changes made)
(41 real changes made)
(22,998 real changes made)
(23,114 missing values generated)
(50 real changes made)
(40 real changes made)
(38 real changes made)
(22,986 real changes made)
(23,101 missing values generated)
(50 real changes made)
(39 real changes made)
(41 real changes made)
(22,971 real changes made)
(23,090 missing values generated)
(49 real changes made)
(40 real changes made)
(41 real changes made)
(22,960 real changes made)
(23,111 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(22,980 real changes made)
(23,136 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(23,005 real changes made)
(23,110 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(22,979 real changes made)
(23,204 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(23,073 real changes made)
(23,189 missing values generated)
(50 real changes made)
(40 real changes made)
(41 real changes made)
(23,058 real changes made)
(22,838 missing values generated)
(48 real changes made)
(40 real changes made)
(41 real changes made)
(22,709 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_date) failure(fail_ae_all==1) 

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date

--------------------------------------------------------------------------
     23,315  total observations
         32  observations end on or before enter()
--------------------------------------------------------------------------
     23,283  observations remaining, representing
     23,283  subjects
      3,108  failures in single-failure-per-subject data
    603,474  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        28

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==0&min(sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  44

. count if fail_ae_all==0&drug==1&min(paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  0

. count if fail_ae_all==0&drug==2&min(sotrovimab_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  0

. count if fail_ae_all==0&drug==3&min(sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d)==stop_ae_all
  0

. // keep if _st==1 -> observations end on or before enter -> should be 0 in actual dataset
. tab _t,m

   Analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |        134        0.57        0.57
          1 |        117        0.50        1.08
          2 |        128        0.55        1.63
          3 |        109        0.47        2.09
          4 |        130        0.56        2.65
          5 |        123        0.53        3.18
          6 |        137        0.59        3.77
          7 |        103        0.44        4.21
          8 |        111        0.48        4.68
          9 |         99        0.42        5.11
         10 |        115        0.49        5.60
         11 |        116        0.50        6.10
         12 |        106        0.45        6.55
         13 |        102        0.44        6.99
         14 |        116        0.50        7.49
         15 |         95        0.41        7.90
         16 |         99        0.42        8.32
         17 |        105        0.45        8.77
         18 |        131        0.56        9.33
         19 |        141        0.60        9.94
         20 |        144        0.62       10.56
         21 |        149        0.64       11.19
         22 |        147        0.63       11.83
         23 |        123        0.53       12.35
         24 |        173        0.74       13.09
         25 |        131        0.56       13.66
         26 |        170        0.73       14.39
         27 |        160        0.69       15.07
         28 |     19,769       84.79       99.86
          . |         32        0.14      100.00
------------+-----------------------------------
      Total |     23,315      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       133          0          1          0 |       134 
           |      0.57       0.00       2.50       0.00 |      0.57 
-----------+--------------------------------------------+----------
         1 |       116          1          0          0 |       117 
           |      0.50       2.00       0.00       0.00 |      0.50 
-----------+--------------------------------------------+----------
         2 |       128          0          0          0 |       128 
           |      0.55       0.00       0.00       0.00 |      0.55 
-----------+--------------------------------------------+----------
         3 |       108          1          0          0 |       109 
           |      0.47       2.00       0.00       0.00 |      0.47 
-----------+--------------------------------------------+----------
         4 |       129          0          0          1 |       130 
           |      0.56       0.00       0.00       2.44 |      0.56 
-----------+--------------------------------------------+----------
         5 |       123          0          0          0 |       123 
           |      0.53       0.00       0.00       0.00 |      0.53 
-----------+--------------------------------------------+----------
         6 |       135          1          1          0 |       137 
           |      0.58       2.00       2.50       0.00 |      0.59 
-----------+--------------------------------------------+----------
         7 |       103          0          0          0 |       103 
           |      0.44       0.00       0.00       0.00 |      0.44 
-----------+--------------------------------------------+----------
         8 |       111          0          0          0 |       111 
           |      0.48       0.00       0.00       0.00 |      0.48 
-----------+--------------------------------------------+----------
         9 |        99          0          0          0 |        99 
           |      0.43       0.00       0.00       0.00 |      0.42 
-----------+--------------------------------------------+----------
        10 |       115          0          0          0 |       115 
           |      0.50       0.00       0.00       0.00 |      0.49 
-----------+--------------------------------------------+----------
        11 |       116          0          0          0 |       116 
           |      0.50       0.00       0.00       0.00 |      0.50 
-----------+--------------------------------------------+----------
        12 |       105          1          0          0 |       106 
           |      0.45       2.00       0.00       0.00 |      0.45 
-----------+--------------------------------------------+----------
        13 |       102          0          0          0 |       102 
           |      0.44       0.00       0.00       0.00 |      0.44 
-----------+--------------------------------------------+----------
        14 |       115          0          1          0 |       116 
           |      0.50       0.00       2.50       0.00 |      0.50 
-----------+--------------------------------------------+----------
        15 |        95          0          0          0 |        95 
           |      0.41       0.00       0.00       0.00 |      0.41 
-----------+--------------------------------------------+----------
        16 |        99          0          0          0 |        99 
           |      0.43       0.00       0.00       0.00 |      0.42 
-----------+--------------------------------------------+----------
        17 |       104          0          0          1 |       105 
           |      0.45       0.00       0.00       2.44 |      0.45 
-----------+--------------------------------------------+----------
        18 |       129          1          1          0 |       131 
           |      0.56       2.00       2.50       0.00 |      0.56 
-----------+--------------------------------------------+----------
        19 |       140          0          0          1 |       141 
           |      0.60       0.00       0.00       2.44 |      0.60 
-----------+--------------------------------------------+----------
        20 |       143          0          0          1 |       144 
           |      0.62       0.00       0.00       2.44 |      0.62 
-----------+--------------------------------------------+----------
        21 |       149          0          0          0 |       149 
           |      0.64       0.00       0.00       0.00 |      0.64 
-----------+--------------------------------------------+----------
        22 |       146          0          1          0 |       147 
           |      0.63       0.00       2.50       0.00 |      0.63 
-----------+--------------------------------------------+----------
        23 |       123          0          0          0 |       123 
           |      0.53       0.00       0.00       0.00 |      0.53 
-----------+--------------------------------------------+----------
        24 |       173          0          0          0 |       173 
           |      0.75       0.00       0.00       0.00 |      0.74 
-----------+--------------------------------------------+----------
        25 |       130          1          0          0 |       131 
           |      0.56       2.00       0.00       0.00 |      0.56 
-----------+--------------------------------------------+----------
        26 |       168          0          1          1 |       170 
           |      0.72       0.00       2.50       2.44 |      0.73 
-----------+--------------------------------------------+----------
        27 |       159          0          1          0 |       160 
           |      0.69       0.00       2.50       0.00 |      0.69 
-----------+--------------------------------------------+----------
        28 |    19,656         44         33         36 |    19,769 
           |     84.78      88.00      82.50      87.80 |     84.79 
-----------+--------------------------------------------+----------
         . |        32          0          0          0 |        32 
           |      0.14       0.00       0.00       0.00 |      0.14 
-----------+--------------------------------------------+----------
     Total |    23,184         50         40         41 |    23,315 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       133          0          1          0 |       134 
           |      4.30       0.00      14.29       0.00 |      4.31 
-----------+--------------------------------------------+----------
         1 |        98          1          0          0 |        99 
           |      3.17      16.67       0.00       0.00 |      3.19 
-----------+--------------------------------------------+----------
         2 |       115          0          0          0 |       115 
           |      3.72       0.00       0.00       0.00 |      3.70 
-----------+--------------------------------------------+----------
         3 |       104          1          0          0 |       105 
           |      3.37      16.67       0.00       0.00 |      3.38 
-----------+--------------------------------------------+----------
         4 |       126          0          0          1 |       127 
           |      4.08       0.00       0.00      20.00 |      4.09 
-----------+--------------------------------------------+----------
         5 |       123          0          0          0 |       123 
           |      3.98       0.00       0.00       0.00 |      3.96 
-----------+--------------------------------------------+----------
         6 |       135          1          1          0 |       137 
           |      4.37      16.67      14.29       0.00 |      4.41 
-----------+--------------------------------------------+----------
         7 |       103          0          0          0 |       103 
           |      3.33       0.00       0.00       0.00 |      3.31 
-----------+--------------------------------------------+----------
         8 |       111          0          0          0 |       111 
           |      3.59       0.00       0.00       0.00 |      3.57 
-----------+--------------------------------------------+----------
         9 |        99          0          0          0 |        99 
           |      3.20       0.00       0.00       0.00 |      3.19 
-----------+--------------------------------------------+----------
        10 |       115          0          0          0 |       115 
           |      3.72       0.00       0.00       0.00 |      3.70 
-----------+--------------------------------------------+----------
        11 |       116          0          0          0 |       116 
           |      3.75       0.00       0.00       0.00 |      3.73 
-----------+--------------------------------------------+----------
        12 |       105          1          0          0 |       106 
           |      3.40      16.67       0.00       0.00 |      3.41 
-----------+--------------------------------------------+----------
        13 |       102          0          0          0 |       102 
           |      3.30       0.00       0.00       0.00 |      3.28 
-----------+--------------------------------------------+----------
        14 |       115          0          1          0 |       116 
           |      3.72       0.00      14.29       0.00 |      3.73 
-----------+--------------------------------------------+----------
        15 |        95          0          0          0 |        95 
           |      3.07       0.00       0.00       0.00 |      3.06 
-----------+--------------------------------------------+----------
        16 |        99          0          0          0 |        99 
           |      3.20       0.00       0.00       0.00 |      3.19 
-----------+--------------------------------------------+----------
        17 |       104          0          0          1 |       105 
           |      3.37       0.00       0.00      20.00 |      3.38 
-----------+--------------------------------------------+----------
        18 |        91          1          1          0 |        93 
           |      2.94      16.67      14.29       0.00 |      2.99 
-----------+--------------------------------------------+----------
        19 |       105          0          0          1 |       106 
           |      3.40       0.00       0.00      20.00 |      3.41 
-----------+--------------------------------------------+----------
        20 |        88          0          0          1 |        89 
           |      2.85       0.00       0.00      20.00 |      2.86 
-----------+--------------------------------------------+----------
        21 |       105          0          0          0 |       105 
           |      3.40       0.00       0.00       0.00 |      3.38 
-----------+--------------------------------------------+----------
        22 |        99          0          1          0 |       100 
           |      3.20       0.00      14.29       0.00 |      3.22 
-----------+--------------------------------------------+----------
        23 |        81          0          0          0 |        81 
           |      2.62       0.00       0.00       0.00 |      2.61 
-----------+--------------------------------------------+----------
        24 |       117          0          0          0 |       117 
           |      3.79       0.00       0.00       0.00 |      3.76 
-----------+--------------------------------------------+----------
        25 |        81          1          0          0 |        82 
           |      2.62      16.67       0.00       0.00 |      2.64 
-----------+--------------------------------------------+----------
        26 |       111          0          1          1 |       113 
           |      3.59       0.00      14.29      20.00 |      3.64 
-----------+--------------------------------------------+----------
        27 |       108          0          1          0 |       109 
           |      3.50       0.00      14.29       0.00 |      3.51 
-----------+--------------------------------------------+----------
        28 |       106          0          0          0 |       106 
           |      3.43       0.00       0.00       0.00 |      3.41 
-----------+--------------------------------------------+----------
     Total |     3,090          6          7          5 |     3,108 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |       133          0          1          0 |       134 
         1 |        98          1          0          0 |        99 
         2 |       115          0          0          0 |       115 
         3 |       104          1          0          0 |       105 
         4 |       126          0          0          1 |       127 
         5 |       123          0          0          0 |       123 
         6 |       135          1          1          0 |       137 
         7 |       103          0          0          0 |       103 
         8 |       111          0          0          0 |       111 
         9 |        99          0          0          0 |        99 
        10 |       115          0          0          0 |       115 
        11 |       116          0          0          0 |       116 
        12 |       105          1          0          0 |       106 
        13 |       102          0          0          0 |       102 
        14 |       115          0          1          0 |       116 
        15 |        95          0          0          0 |        95 
        16 |        99          0          0          0 |        99 
        17 |       104          0          0          1 |       105 
        18 |        91          1          1          0 |        93 
        19 |       105          0          0          1 |       106 
        20 |        88          0          0          1 |        89 
        21 |       105          0          0          0 |       105 
        22 |        99          0          1          0 |       100 
        23 |        81          0          0          0 |        81 
        24 |       117          0          0          0 |       117 
        25 |        81          1          0          0 |        82 
        26 |       111          0          1          1 |       113 
        27 |       108          0          1          0 |       109 
        28 |       106          0          0          0 |       106 
-----------+--------------------------------------------+----------
     Total |     3,090          6          7          5 |     3,108 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |    20,094         44         33         36 |    20,207 
           |     86.67      88.00      82.50      87.80 |     86.67 
-----------+--------------------------------------------+----------
         1 |     3,090          6          7          5 |     3,108 
           |     13.33      12.00      17.50      12.20 |     13.33 
-----------+--------------------------------------------+----------
     Total |    23,184         50         40         41 |    23,315 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         7 |         7 
           |     58.33 |     58.33 
-----------+-----------+----------
         2 |         3 |         3 
           |     25.00 |     25.00 
-----------+-----------+----------
         3 |         1 |         1 
           |      8.33 |      8.33 
-----------+-----------+----------
         4 |         1 |         1 
           |      8.33 |      8.33 
-----------+-----------+----------
     Total |        12 |        12 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         7 |         7 
           |     43.75 |     43.75 
-----------+-----------+----------
         2 |         4 |         4 
           |     25.00 |     25.00 
-----------+-----------+----------
         3 |         3 |         3 
           |     18.75 |     18.75 
-----------+-----------+----------
         4 |         2 |         2 
           |     12.50 |     12.50 
-----------+-----------+----------
     Total |        16 |        16 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d)&drug==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==0,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |         5 |         5 
           |     41.67 |     41.67 
-----------+-----------+----------
         2 |         7 |         7 
           |     58.33 |     58.33 
-----------+-----------+----------
     Total |        12 |        12 
           |    100.00 |    100.00 

. 
. save "$projectdir/output/data/main.dta", replace
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/output/data/main.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_dataset.log
  log type:  text
 closed on:  11 May 2023, 11:03:00
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
