--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_dataset.log
  log type:  text
 opened on:   2 May 2023, 11:22:04

. 
. * import dataset
. import delimited "$projectdir/output/input.csv", clear
(encoding automatically selected: ISO-8859-1)
(197 vars, 500,000 obs)

. 
. *Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata17\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata17\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\users\PUBLIC\documents/"
  [5]  (PLUS)      "C:\users\PUBLIC\documents/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/analysis/extra_ados"

. 
. //describe
. //codebook
. 
. *  Convert strings to dates  *
. foreach var of varlist   covid_test_positive_date                               ///
>                                                  covid_test_positive_date2                              ///
>                                                  covid_symptoms_snomed                                  ///     
>                                                  prior_covid_date                                       ///
>                                                  sotrovimab                                                             ///
>                                                  molnupiravir                                                   /// 
>                                                  paxlovid                                                               ///
>                                                  remdesivir                                                             ///
>                                                  casirivimab                                                    ///
>                                                  sotrovimab_not_start                                   ///
>                                                  molnupiravir_not_start                                 ///
>                                                  paxlovid_not_start                                             ///
>                                                  casirivimab_not_start                                  ///
>                                                  remdesivir_not_start                                   ///
>                                                  sotrovimab_stopped                                             ///
>                                                  molnupiravir_stopped                                   ///
>                                                  paxlovid_stopped                                               ///
>                                                  casirivimab_stopped                                    ///
>                                                  remdesivir_stopped                                             ///
>                                                  date_treated                                                   ///
>                                                  drugs_do_not_use                                               ///
>                                                  drugs_consider_risk                                    ///
>                                                  last_vaccination_date                                  ///
>                                                  covid_test_positive_pre_date                   ///
>                                                  death_date                                                             ///
>                                                  dereg_date                                                     ///
>                                                  bmi_date_measured                                              ///
>                                                  creatinine_ctv3_date                                   ///
>                                                  creatinine_snomed_date                                 ///
>                                                  creatinine_short_snomed_date                   ///
>                                                  covid_discharge_date_primary                   ///
>                                                  any_covid_hosp_discharge                               ///                     
>                                                  ae_diverticulitis_icd                                  ///
>                                                  ae_diverticulitis_snomed                               ///
>                                              ae_diarrhoea_snomed                                        ///
>                                                  ae_taste_snomed                                                ///
>                                                  ae_taste_icd                                                   ///
>                                                  ae_rheumatoid_arthritis_snomed                 ///
>                                                  ae_rheumatoid_arthritis_icd                    ///
>                                                  ae_sle_ctv                                                             ///
>                                                  ae_sle_icd                                                             ///
>                                                  ae_psoriasis_snomed                                    ///
>                                                  ae_psoriatic_arthritis_snomed                  ///
>                                                  ae_ankylosing_spondylitis_ctv                  ///
>                                                  ae_ibd_snomed                                                  ///
>                                                  rheumatoid_arthritis_nhsd_snomed               ///
>                                                  rheumatoid_arthritis_nhsd_icd10                ///
>                                                  sle_nhsd_ctv                                                   ///
>                                                  sle_nhsd_icd10                                                 ///
>                                                  psoriasis_nhsd                                                 ///
>                                                  psoriatic_arthritis_nhsd                               ///
>                                                  ankylosing_spondylitis_nhsd                    ///
>                                                  ibd_ctv                                                                ///
>                                                  all_hosp_date                                                  ///
>                                                  all_hosp_date0                                                 ///
>                                                  all_hosp_date1                                                 ///
>                                                  all_hosp_date2                                                 ///
>                                                  hosp_discharge_date                                    ///
>                                                  hosp_discharge_date0                                   ///
>                                                  hosp_discharge_date1                                   ///
>                                                  hosp_discharge_date2                                   ///
>                                                  covid_hosp_date                                                ///
>                                                  covid_hosp_date_primary                                ///
>                                                  covid_hosp_date0                                               ///
>                                                  covid_hosp_date1                                               ///
>                                                  covid_hosp_date2                                               ///                                             
>                                                  covid_discharge_date0                            ///                                           
>                                                  covid_discharge_date1                                  /// 
>                                                  covid_discharge_date2                                  /// 
>                                                  covid_hosp_date_mabs                                   /// 
>                                                  covid_hosp_date_mabs_not_primary               /// 
>                                                  covid_hosp_date_mabs_day                               ///
>                                                  died_date_ons                                                  ///
>                                                  died_ons_covid {                                        
  2.         capture confirm string variable `var'
  3.         if _rc==0 {
  4.         rename `var' a
  5.         gen `var' = date(a, "YMD")
  6.         drop a
  7.         format %td `var'
  8.  }
  9. }
(49,999 missing values generated)
(450,000 missing values generated)
(476,794 missing values generated)
(49,999 missing values generated)
(49,999 missing values generated)
(49,999 missing values generated)
(49,999 missing values generated)
(49,999 missing values generated)
(49,999 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(4 missing values generated)
(475,000 missing values generated)
(475,000 missing values generated)
(25,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(25,000 missing values generated)
(25,000 missing values generated)
(250,000 missing values generated)
(250,000 missing values generated)
(450,000 missing values generated)
(475,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(400,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(450,000 missing values generated)
(200,000 missing values generated)
(200,000 missing values generated)

. 
. *check hosp/death event date range*
. codebook covid_test_positive_date date_treated all_hosp_date died_date_ons

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
covid_test_positive_date                                                                                                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22626,23132]                 Units: 1
       Or equivalently: [12dec2021,02may2023]         Units: days
         Unique values: 507                       Missing .: 49,999/500,000

                  Mean: 22879.1 = 22aug2022(+ 2 hours)
             Std. dev.: 146.444
           Percentiles:       10%        25%        50%        75%        90%
                            22676      22752      22879      23006      23082
                        31jan2022  17apr2022  22aug2022  27dec2022  13mar2023

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
date_treated                                                                                                                                                                                                               (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22631,23132]                 Units: 1
       Or equivalently: [17dec2021,02may2023]         Units: days
         Unique values: 491                       Missing .: 4/500,000

                  Mean: 22723.4 = 19mar2022(+ 9 hours)
             Std. dev.: 78.5013
           Percentiles:       10%        25%        50%        75%        90%
                            22642      22662      22703      22765      22836
                        28dec2021  17jan2022  27feb2022  30apr2022  10jul2022

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
all_hosp_date                                                                                                                                                                                                              (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22693,23132]                 Units: 1
       Or equivalently: [17feb2022,02may2023]         Units: days
         Unique values: 440                       Missing .: 450,000/500,000

                  Mean: 22912.8 = 24sep2022(+ 20 hours)
             Std. dev.: 127.275
           Percentiles:       10%        25%        50%        75%        90%
                            22737      22802      22913      23023      23090
                        02apr2022  06jun2022  25sep2022  13jan2023  21mar2023

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
died_date_ons                                                                                                                                                                                                              (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [22282,23132]                 Units: 1
       Or equivalently: [02jan2021,02may2023]         Units: days
         Unique values: 851                       Missing .: 200,000/500,000

                  Mean: 22706.8 = 02mar2022(+ 20 hours)
             Std. dev.: 245.633
           Percentiles:       10%        25%        50%        75%        90%
                            22366      22494      22707      22919      23048
                        27mar2021  02aug2021  03mar2022  01oct2022  07feb2023

. 
. 
. ****************************
. *       EXPOSURE                *
. ****************************
. foreach var of varlist sotrovimab molnupiravir paxlovid remdesivir casirivimab{
  2.     display "`var'"
  3.         gen `var'_check = 1 if `var'>=covid_test_positive_date & `var'<=covid_test_positive_date+5 & `var'!=.
  4.         replace `var'_check = 0 if (`var' < covid_test_positive_date | `var' > covid_test_positive_date + 5) & `var'!=.
  5.         sum `var'
  6.         tab `var'_check, m  // should be no 0s
  7.         sum `var'_not_start // number prescribed but not started
  8.         gen `var'_started = 1 if `var'_not_start==. & `var'_check==1
  9.         tab `var'_started, m
 10.         gen `var'_date_started = `var' if `var'==date_treated & `var'_started==1 
 11.         sum `var'_date_started
 12. }
sotrovimab
(495,148 missing values generated)
(445,149 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  sotrovimab |    450,001     22881.7    144.8759      22631      23132

sotrovimab_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    445,149       89.03       89.03
          1 |      4,852        0.97       90.00
          . |     49,999       10.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
sotrovimab~t |     50,000    22880.89    144.7877      22631      23132
(495,618 missing values generated)

sotrovimab_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,382        0.88        0.88
          . |    495,618       99.12      100.00
------------+-----------------------------------
      Total |    500,000      100.00
(498,979 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
so~e_started |      1,021    22725.34    74.61504      22631      23029
molnupiravir
(495,222 missing values generated)
(445,223 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
molnupiravir |    450,001     22881.4    144.8827      22631      23132

molnupiravi |
    r_check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    445,223       89.04       89.04
          1 |      4,778        0.96       90.00
          . |     49,999       10.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
molnupirav~t |     50,000    22881.47    145.1449      22631      23132
(495,642 missing values generated)

molnupiravi |
  r_started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,358        0.87        0.87
          . |    495,642       99.13      100.00
------------+-----------------------------------
      Total |    500,000      100.00
(499,025 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
mo~e_started |        975     22723.8    77.09072      22631      23034
paxlovid
(495,044 missing values generated)
(445,045 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    paxlovid |    450,001    22881.71    145.1046      22631      23132

paxlovid_ch |
        eck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    445,045       89.01       89.01
          1 |      4,956        0.99       90.00
          . |     49,999       10.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_n~t |     50,000    22882.08    145.2125      22631      23132
(495,548 missing values generated)

paxlovid_st |
      arted |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,452        0.89        0.89
          . |    495,548       99.11      100.00
------------+-----------------------------------
      Total |    500,000      100.00
(498,970 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
paxlovid_d~d |      1,030    22726.63     79.4489      22631      23059
remdesivir
(495,312 missing values generated)
(445,313 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  remdesivir |    450,001    22881.16    144.9318      22631      23132

remdesivir_ |
      check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    445,313       89.06       89.06
          1 |      4,688        0.94       90.00
          . |     49,999       10.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
remdesivir~t |     50,000    22881.02    144.7426      22631      23132
(495,839 missing values generated)

remdesivir_ |
    started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,161        0.83        0.83
          . |    495,839       99.17      100.00
------------+-----------------------------------
      Total |    500,000      100.00
(499,076 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
re~e_started |        924    22723.19     79.5809      22631      23106
casirivimab
(495,282 missing values generated)
(445,283 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 casirivimab |    450,001    22881.42     144.908      22631      23132

casirivimab |
     _check |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    445,283       89.06       89.06
          1 |      4,718        0.94       90.00
          . |     49,999       10.00      100.00
------------+-----------------------------------
      Total |    500,000      100.00

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
casirivima~t |     50,000    22881.11    144.6902      22631      23132
(495,774 missing values generated)

casirivimab |
   _started |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,226        0.85        0.85
          . |    495,774       99.15      100.00
------------+-----------------------------------
      Total |    500,000      100.00
(499,059 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ca~e_started |        941    22725.31    78.58794      22631      23022

. gen drug=1 if sotrovimab==date_treated & sotrovimab_start==1 
(498,979 missing values generated)

. replace drug=2 if paxlovid==date_treated & paxlovid_start==1
(1,030 real changes made)

. replace drug=3 if molnupiravir==date_treated & molnupiravir_start==1
(975 real changes made)

. replace drug=4 if (remdesivir==date_treated & remdesivir_start==1)  | (casirivimab==date_treated & casirivimab==1)
(924 real changes made)

. replace drug=0 if drug==.
(496,059 real changes made)

. label define drug 0 "control" 1 "sotrovimab" 2 "paxlovid" 3"molnupiravir" 4"other", replace

. label values drug drug

. tab drug, m

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |    496,059       99.21       99.21
  sotrovimab |      1,017        0.20       99.42
    paxlovid |      1,025        0.20       99.62
molnupiravir |        975        0.20       99.82
       other |        924        0.18      100.00
-------------+-----------------------------------
       Total |    500,000      100.00

. gen start_date=date_treated if drug>0 
(496,059 missing values generated)

. format start_date %td

. egen median_time = median(date_treated - covid_test_positive_date) if drug>0 & drug<4
(496,983 missing values generated)

. egen median_max = max(median_time)

. sum median_time

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 median_time |      3,017           2           0          2          2

. replace start_date = covid_test_positive_date + median_max if drug==0
(446,060 real changes made)

. bys drug: count if start_date==. // should be no 0s

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  49,999
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. *start and end date
. gen study_end_date=mdy(06,01,2023)

. gen start_date_29=start_date+28
(49,999 missing values generated)

. format study_end_date start_date_29 %td

. 
. ****************************
. *       INCLUSION               *
. ****************************
. ***Inclusion criteria*
. keep if age>=18 & age<110
(106,434 observations deleted)

. keep if sex=="F"|sex=="M"
(0 observations deleted)

. keep if has_died==0
(19,668 observations deleted)

. *check covid positive, and not repeat covid test after an infection within 30 days prior
. tab covid_test_positive covid_positive_previous_30_days, m

           | covid_positive_previo
covid_test |      us_30_days
 _positive |         0          1 |     Total
-----------+----------------------+----------
         0 |    35,559      1,902 |    37,461 
         1 |   319,576     16,861 |   336,437 
-----------+----------------------+----------
     Total |   355,135     18,763 |   373,898 

. keep if covid_test_positive==1 & covid_positive_previous_30_days==0
(54,322 observations deleted)

. 
. ***Exclusion criteria*
. *capture and exclude if death or deregistration is on the start date 
. count if start_date>=dereg_date & start_date!=.
  28,536

. count if start_date>=death_date & start_date!=.
  28,520

. drop if start_date>=death_date | start_date>=dereg_date
(86,104 observations deleted)

. 
. 
. ****************************
. *       OUTCOME         *
. ****************************
. 
. *** Primary outcome - AESI
. bys drug: count if ae_rheumatoid_arthritis_icd!=. & (rheumatoid_arthritis_nhsd_snomed==1 | rheumatoid_arthritis_nhsd_icd10==1)

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8,738
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  17
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  25
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  18
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  19

. gen new_ae_ra_icd = ae_rheumatoid_arthritis_icd if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(195,669 missing values generated)

. gen new_ae_ra_snomed = ae_rheumatoid_arthritis_snomed if rheumatoid_arthritis_nhsd_snomed==0 & rheumatoid_arthritis_nhsd_icd10==0  
(195,500 missing values generated)

. gen new_ae_sle_icd = ae_sle_icd if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(195,710 missing values generated)

. gen new_ae_sle_ctv = ae_sle_ctv if sle_nhsd_ctv==0 & sle_nhsd_icd10==0
(195,697 missing values generated)

. gen new_ae_psoriasis_snomed = ae_psoriasis_snomed if psoriasis_nhsd==0
(191,552 missing values generated)

. gen new_ae_psa_snomed = ae_psoriatic_arthritis_snomed if psoriatic_arthritis_nhsd==0
(191,285 missing values generated)

. gen new_ae_ankspon_ctv = ae_ankylosing_spondylitis_ctv if ankylosing_spondylitis_nhsd==0
(191,696 missing values generated)

. gen new_ae_ibd_snomed = ae_ibd_snomed if ibd_ctv==0
(191,481 missing values generated)

. global ae_spc           ae_diverticulitis_snomed                ///
>                                         ae_diarrhoea_snomed                             ///
>                                         ae_taste_snomed                                         

. global ae_spc_icd       ae_diverticulitis_icd                   ///
>                                         ae_taste_icd                                    

. global ae_imae          new_ae_ra_snomed                                ///
>                                         new_ae_sle_ctv                                  ///
>                                         new_ae_psoriasis_snomed                 ///
>                                         new_ae_psa_snomed                               ///
>                                         new_ae_ankspon_ctv                              ///
>                                         new_ae_ibd      

. global ae_imae_icd      new_ae_ra_icd                                   ///
>                                         new_ae_sle_icd                                                  

. *remove event if occurred before start (including new start date for control)
. foreach x in $ae_spc $ae_spc_icd $ae_imae $ae_imae_icd{
  2.                                 display "`x'"
  3.                                 bys drug: count if (`x' < start_date | `x' > start_date + 28) & `x'!=.
  4.                                 replace `x'=. if (`x' < start_date | `x' > start_date + 28) & `x'!=.
  5. }
ae_diverticulitis_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  43,682
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  106
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  94
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  70
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  83
(44,035 real changes made, 44,035 to missing)
ae_diarrhoea_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  43,698
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  95
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  126
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  109
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  99
(44,127 real changes made, 44,127 to missing)
ae_taste_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  43,671
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  116
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  110
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  96
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  94
(44,087 real changes made, 44,087 to missing)
ae_diverticulitis_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  43,793
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  80
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  104
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  101
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  77
(44,155 real changes made, 44,155 to missing)
ae_taste_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  43,748
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  96
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  83
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  103
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  92
(44,122 real changes made, 44,122 to missing)
new_ae_ra_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  35,591
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  72
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  74
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  69
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  62
(35,868 real changes made, 35,868 to missing)
new_ae_sle_ctv

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  35,408
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  77
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  73
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  60
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  74
(35,692 real changes made, 35,692 to missing)
new_ae_psoriasis_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  39,251
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  96
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  92
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  94
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  63
(39,596 real changes made, 39,596 to missing)
new_ae_psa_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  39,501
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  97
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  81
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  88
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  75
(39,842 real changes made, 39,842 to missing)
new_ae_ankspon_ctv

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  39,067
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  83
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  83
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  85
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  80
(39,398 real changes made, 39,398 to missing)
new_ae_ibd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  39,298
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  85
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  95
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  87
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  82
(39,647 real changes made, 39,647 to missing)
new_ae_ra_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  35,298
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  73
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  81
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  65
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  67
(35,584 real changes made, 35,584 to missing)
new_ae_sle_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  35,302
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  79
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  84
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  78
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  83
(35,626 real changes made, 35,626 to missing)

. egen ae_spc_gp = rmin($ae_spc)
(225,724 missing values generated)

. egen ae_spc_serious = rmin($ae_spc_icd)
(228,237 missing values generated)

. egen ae_spc_all = rmin($ae_spc $ae_spc_icd)
(220,687 missing values generated)

. egen ae_imae_gp = rmin($ae_imae)        
(220,248 missing values generated)

. egen ae_imae_serious = rmin($ae_imae_icd)
(229,141 missing values generated)

. egen ae_imae_all = rmin($ae_imae $ae_imae_icd)  
(216,173 missing values generated)

. egen ae_all = rmin($ae_spc $ae_spc_icd $ae_imae $ae_imae_icd)
(204,429 missing values generated)

. egen ae_all_serious = rmin($ae_spc_icd $ae_imae_icd)
(224,020 missing values generated)

. by drug, sort: count if ae_spc_all!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  12,683
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  20
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  32
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  24
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  26

. by drug, sort: count if ae_all!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  28,799
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  56
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  67
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  58
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  63

. by drug, sort: count if ae_all_serious!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,389
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  12
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  16
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  20
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  15

. 
. *** Secondary outcome - SAEs hospitalisation or death including COVID-19 
. *correcting COVID hosp events: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. by drug, sort: count if covid_hosp_date!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  22,899
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  59
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  45

. by drug, sort: count if covid_hosp_date0!=. // *nb: control group will not have covid_hosp_date0 - as do not have date_treated

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,302
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  55
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  55
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  40

. // covid admission is the same date as date treated 
. by drug, sort: count if covid_hosp_date0!=date_treated&covid_hosp_date0!=.&date_treated!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,277
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  55
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  55
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  39

. by drug, sort: count if covid_hosp_date1!=(date_treated+1) &covid_hosp_date1!=.&date_treated!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,178
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  45
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  41
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  55

. // covid admission is the same date as date treated and is a daycase
. by drug, sort: count if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  3
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  7
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&covid_hosp_date0==covid_discharge_date0

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&covid_hosp_date1==covid_discharge_date1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date0!=.&(covid_discharge_date0 - covid_hosp_date0)==1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date1!=.&(covid_discharge_date1 - covid_hosp_date1)==1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. // covid admission is PM but discharged in AM 
. count if covid_hosp_date!=.&covid_discharge_date_primary==.
  20,805

. count if covid_hosp_date==.&covid_discharge_date_primary!=.
  20,900

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date==covid_discharge_date_primary
  4

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date<covid_discharge_date_primary
  1,153

. count if covid_hosp_date!=.&covid_discharge_date_primary!=.&covid_hosp_date>covid_discharge_date_primary
  1,155

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. replace covid_hosp_date=. if covid_hosp_date0==covid_discharge_date0&covid_hosp_date0!=.
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_discharge_date1&covid_hosp_date1!=.  // [? Bang is your code for this correct~line 135]
(0 real changes made)

. // REPLACE - ignore covid admission if admission is the day 0 or day 1 after treatment date AND a mab procedures for sotro 
. replace covid_hosp_date=. if covid_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace covid_hosp_date=. if covid_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. 
. *correcting all hosp admission: admitted on day 0 or day 1 after treatment - to ignore sotro initiators with mab procedure codes*
. by drug, sort: count if all_hosp_date!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,070
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  41
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  52
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  44

. by drug, sort: count if all_hosp_date0!=. // *nb: control group will not have covid_hosp_date0 - as do not have date_treated

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,031
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  43

. // admission is the same date as date treated 
. by drug, sort: count if all_hosp_date0!=date_treated&all_hosp_date0!=.&date_treated!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,004
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  54
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  53
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  43

. by drug, sort: count if all_hosp_date1!=(date_treated+1) &all_hosp_date1!=.&date_treated!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  23,099
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  36
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  55
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  48
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  44

. // admission is the same date as date treated and is a daycase
. by drug, sort: count if all_hosp_date0==hosp_discharge_date0&all_hosp_date0!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==hosp_discharge_date1&all_hosp_date1!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  8
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is the same date as mab and is a daycase, 1 day admission
. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&all_hosp_date0==hosp_discharge_date0

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&all_hosp_date1==hosp_discharge_date1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date0==covid_hosp_date_mabs&all_hosp_date0!=.&(hosp_discharge_date0-all_hosp_date0)==1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. by drug, sort: count if all_hosp_date1==covid_hosp_date_mabs&all_hosp_date1!=.&(hosp_discharge_date1-all_hosp_date1)==1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  0

. //  admission is PM but discharged in AM 
. count if all_hosp_date!=.&hosp_discharge_date==.
  20,964

. count if all_hosp_date==.&hosp_discharge_date!=.
  21,087

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date==hosp_discharge_date
  7

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date<hosp_discharge_date
  1,118

. count if all_hosp_date!=.&hosp_discharge_date!=.&all_hosp_date>hosp_discharge_date
  1,171

. // REPLACE - ignore admission if admission it is the day 0 or day 1 after treatment date AND a mab procedures for sotro 
. replace all_hosp_date=. if all_hosp_date0==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1
(0 real changes made)

. replace all_hosp_date=. if all_hosp_date1==covid_hosp_date_mabs&covid_hosp_date_mabs!=.&drug==1 
(0 real changes made)

. // Decision not to REPLACE admission if admission is the day 0 or day 1 after treatment date treated AND a day case
. 
. foreach var of varlist covid_hosp_date all_hosp_date died_date_ons{
  2.                                 display "`var'"
  3.                                 bys drug: count if (`var' < start_date | `var' > start_date + 28) & `var'!=.                            
  4.                                 replace `var'=. if (`var' < start_date | `var' > start_date + 28) & `var'!=.
  5. }
covid_hosp_date

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  21,558
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  52
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  60
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  56
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  43
(21,769 real changes made, 21,769 to missing)
all_hosp_date

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  21,724
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  40
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  50
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  50
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  43
(21,907 real changes made, 21,907 to missing)
died_date_ons

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  134,259
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  300
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  300
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  275
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  262
(135,396 real changes made, 135,396 to missing)

. 
. *** Secondary outcome - severe drug reactions (including DRESS, SJS, TEN, anaphylaxis) 
. 
. ****************************
. *       COVARIATES              *
. ****************************
. by drug,sort: tab high_risk_cohort_covid_therapeut,m

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |     23,126        9.99        9.99
                    HIV or AIDS |     11,688        5.05       15.04
                           IMID |     23,203       10.03       25.07
              IMID,solid cancer |     22,985        9.93       35.00
                             NA |     11,540        4.99       39.99
        haematological diseases |     11,449        4.95       44.93
    haematological malignancies |     11,578        5.00       49.94
                  liver disease |     11,696        5.05       54.99
    primary immune deficiencies |     23,198       10.02       65.01
                  renal disease |     23,428       10.12       75.14
            sickle cell disease |     22,818        9.86       85.00
                   solid cancer |     23,115        9.99       94.98
stem cell transplant recipients |     11,608        5.02      100.00
--------------------------------+-----------------------------------
                          Total |    231,432      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |         46        8.70        8.70
                    HIV or AIDS |         33        6.24       14.93
                           IMID |         51        9.64       24.57
              IMID,solid cancer |         36        6.81       31.38
                             NA |         26        4.91       36.29
        haematological diseases |         29        5.48       41.78
    haematological malignancies |         25        4.73       46.50
                  liver disease |         22        4.16       50.66
    primary immune deficiencies |         56       10.59       61.25
                  renal disease |         51        9.64       70.89
            sickle cell disease |         62       11.72       82.61
                   solid cancer |         62       11.72       94.33
stem cell transplant recipients |         30        5.67      100.00
--------------------------------+-----------------------------------
                          Total |        529      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |         54       10.06       10.06
                    HIV or AIDS |         26        4.84       14.90
                           IMID |         56       10.43       25.33
              IMID,solid cancer |         50        9.31       34.64
                             NA |         20        3.72       38.36
        haematological diseases |         35        6.52       44.88
    haematological malignancies |         38        7.08       51.96
                  liver disease |         30        5.59       57.54
    primary immune deficiencies |         46        8.57       66.11
                  renal disease |         53        9.87       75.98
            sickle cell disease |         59       10.99       86.96
                   solid cancer |         46        8.57       95.53
stem cell transplant recipients |         24        4.47      100.00
--------------------------------+-----------------------------------
                          Total |        537      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |         44        8.70        8.70
                    HIV or AIDS |         22        4.35       13.04
                           IMID |         55       10.87       23.91
              IMID,solid cancer |         39        7.71       31.62
                             NA |         26        5.14       36.76
        haematological diseases |         30        5.93       42.69
    haematological malignancies |         25        4.94       47.63
                  liver disease |         28        5.53       53.16
    primary immune deficiencies |         63       12.45       65.61
                  renal disease |         49        9.68       75.30
            sickle cell disease |         53       10.47       85.77
                   solid cancer |         49        9.68       95.45
stem cell transplant recipients |         23        4.55      100.00
--------------------------------+-----------------------------------
                          Total |        506      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                 Downs syndrome |         44        9.40        9.40
                    HIV or AIDS |         25        5.34       14.74
                           IMID |         44        9.40       24.15
              IMID,solid cancer |         41        8.76       32.91
                             NA |         26        5.56       38.46
        haematological diseases |         24        5.13       43.59
    haematological malignancies |         32        6.84       50.43
                  liver disease |         28        5.98       56.41
    primary immune deficiencies |         46        9.83       66.24
                  renal disease |         46        9.83       76.07
            sickle cell disease |         53       11.32       87.39
                   solid cancer |         44        9.40       96.79
stem cell transplant recipients |         15        3.21      100.00
--------------------------------+-----------------------------------
                          Total |        468      100.00


. gen downs_syndrome_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "Downs syndrome")
(210,158 missing values generated)

. gen solid_cancer_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "solid cancer")
(187,005 missing values generated)

. gen haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "haematological malignancies")
(221,774 missing values generated)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "sickle cell disease")
(23,045 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "haematological diseases")
(11,567 real changes made)

. replace haem_disease_therapeutics=1 if strpos(high_risk_cohort_covid_therapeut, "stem cell transplant")
(11,700 real changes made)

. gen renal_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "renal disease")
(209,845 missing values generated)

. gen liver_disease_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "liver disease")
(221,668 missing values generated)

. gen imid_on_drug_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "IMID")
(186,912 missing values generated)

. gen immunosupression_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "primary immune deficiencies")
(210,063 missing values generated)

. gen hiv_aids_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "HIV or AIDS")
(221,678 missing values generated)

. gen solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "solid organ recipients")
(233,472 missing values generated)

. replace solid_organ_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "solid organ transplant")
(0 real changes made)

. gen rare_neuro_therapeutics= 1 if strpos(high_risk_cohort_covid_therapeut, "rare neurological conditions")
(233,472 missing values generated)

. *check if all diseases have been captured*
. by drug,sort: count if high_risk_cohort_covid_therapeut!=""&high_risk_cohort_covid_therapeut!="other"& min(downs_syndrome_therapeutics,solid_cancer_therapeutics,haem_disease_therapeutics,renal_disease_therapeutics,liver_disease_
> therapeutics,imid_on_drug_therapeutics,immunosupression_therapeutics,hiv_aids_therapeutics,solid_organ_therapeutics,rare_neuro_therapeutics)==.

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  11,540
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  26
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  20
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  26
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  26

. tab high_risk_cohort_covid_therapeut if high_risk_cohort_covid_therapeut!=""&high_risk_cohort_covid_therapeut!="other"& min(downs_syndrome_therapeutics,solid_cancer_therapeutics,haem_disease_therapeutics,renal_disease_therapeuti
> cs,liver_disease_therapeutics,imid_on_drug_therapeutics,immunosupression_therapeutics,hiv_aids_therapeutics,solid_organ_therapeutics,rare_neuro_therapeutics)==.

high_risk_cohort_covid_therapeu |
                           tics |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                             NA |     11,638      100.00      100.00
--------------------------------+-----------------------------------
                          Total |     11,638      100.00

. 
. *clean eligible
. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
  2,325

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0
  1,831

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0 &imid_on_drug==1
  928

. count if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0 &imid_on_drug==1 &downs_syndrome==0 &solid_cancer==0 &haem_disease=
> =0 &renal_disease==0 &liver_disease==0 &immunosupression==0 &hiv_aids==0 &solid_organ_transplant==0 &rare_neuro==0
  50

. count if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imid_drug_hcd==0 
  51,312

. // REPLACE - ignore eligible steriods<4 scripts in last 6m
. replace oral_steroid_drugs_nhsd=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1
(2,325 real changes made)

. replace imid_drug_all=0 if oral_steroid_drug_nhsd_6m_count<4 &oral_steroid_drugs_nhsd==1 &immunosuppresant==0 &methotrexate==0 &ciclosporin==0 &mycophenolate==0 &imid_drug_hcd==0
(0 real changes made)

. // REPLACE - ignore eligible if not coded for imid AND (imid_drug or drug_HCD) & if <4 scripts steriod
. replace imid_on_drug=0 if imid_on_drug==1 & imid_nhsd==1 & imid_drug==0 & imid_drug_hcd==0 
(51,312 real changes made)

. gen eligible_clean=((downs_syndrome + solid_cancer + haem_disease + renal_disease + liver_disease + imid_on_drug + immunosupression + hiv_aids + solid_organ_transplant + rare_neuro )>0)

. rename solid_organ_transplant solid_organ

. tab eligible_clean eligible

eligible_c |       eligible
      lean |         0          1 |     Total
-----------+----------------------+----------
         0 |     5,104      2,232 |     7,336 
         1 |         0    226,136 |   226,136 
-----------+----------------------+----------
     Total |     5,104    228,368 |   233,472 

. count if high_risk_cohort_covid_therapeut=="" & eligible_clean==1
  0

. count if high_risk_cohort_covid_therapeut!="" & eligible_clean==0
  7,336

. 
. foreach var of varlist downs_syndrome solid_cancer haem_disease renal_disease liver_disease imid_on_drug immunosupression hiv_aids solid_organ rare_neuro {
  2.         replace `var'_therapeutics=0 if `var'_therapeutics==.
  3.         display `var'
  4.         tab `var'_therapeutics `var'
  5.         gen `var'_all = 1 if `var'==1 | `var'_therapeutics==1
  6. }
(210,158 real changes made)
1

downs_synd |
rome_thera |    downs_syndrome
   peutics |         0          1 |     Total
-----------+----------------------+----------
         0 |   170,364     39,794 |   210,158 
         1 |    18,850      4,464 |    23,314 
-----------+----------------------+----------
     Total |   189,214     44,258 |   233,472 
(170,364 missing values generated)
(187,005 real changes made)
0

solid_canc |
er_therape |     solid_cancer
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |   168,355     18,650 |   187,005 
         1 |    41,811      4,656 |    46,467 
-----------+----------------------+----------
     Total |   210,166     23,306 |   233,472 
(168,355 missing values generated)
(175,462 real changes made)
0

haem_disea |
se_therape |     haem_disease
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |    92,194     83,268 |   175,462 
         1 |    30,381     27,629 |    58,010 
-----------+----------------------+----------
     Total |   122,575    110,897 |   233,472 
(92,194 missing values generated)
(209,845 real changes made)
0

renal_dise |
ase_therap |     renal_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |   137,836     72,009 |   209,845 
         1 |    15,589      8,038 |    23,627 
-----------+----------------------+----------
     Total |   153,425     80,047 |   233,472 
(137,836 missing values generated)
(221,668 real changes made)
1

liver_dise |
ase_therap |     liver_disease
    eutics |         0          1 |     Total
-----------+----------------------+----------
         0 |   179,685     41,983 |   221,668 
         1 |     9,529      2,275 |    11,804 
-----------+----------------------+----------
     Total |   189,214     44,258 |   233,472 
(179,685 missing values generated)
(186,912 real changes made)
0

imid_on_dr |
ug_therape |     imid_on_drug
     utics |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,544     52,368 |   186,912 
         1 |    33,549     13,011 |    46,560 
-----------+----------------------+----------
     Total |   168,093     65,379 |   233,472 
(134,544 missing values generated)
(210,063 real changes made)
1

immunosupr |
ession_the |   immunosupression
 rapeutics |         0          1 |     Total
-----------+----------------------+----------
         0 |   189,033     21,030 |   210,063 
         1 |    20,998      2,411 |    23,409 
-----------+----------------------+----------
     Total |   210,031     23,441 |   233,472 
(189,033 missing values generated)
(221,678 real changes made)
1

hiv_aids_t |
herapeutic |       hiv_aids
         s |         0          1 |     Total
-----------+----------------------+----------
         0 |   179,339     42,339 |   221,678 
         1 |     9,571      2,223 |    11,794 
-----------+----------------------+----------
     Total |   188,910     44,562 |   233,472 
(179,339 missing values generated)
(233,472 real changes made)
1

solid_orga |
n_therapeu |      solid_organ
      tics |         0          1 |     Total
-----------+----------------------+----------
         0 |   160,373     73,099 |   233,472 
-----------+----------------------+----------
     Total |   160,373     73,099 |   233,472 
(160,373 missing values generated)
(233,472 real changes made)
1

rare_neuro |
_therapeut |      rare_neuro
       ics |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,366    133,106 |   233,472 
-----------+----------------------+----------
     Total |   100,366    133,106 |   233,472 
(100,366 missing values generated)

. // decision to use primary care variable for identification of high risk rather than CMU as not present for ocontrol group
. 
. *Time between positive test and treatment*
. gen postest_treat=start_date-covid_test_positive_date

. tab postest_treat,m

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        354        0.15        0.15
          1 |        322        0.14        0.29
          2 |    231,786       99.28       99.57
          3 |        322        0.14       99.71
          4 |        310        0.13       99.84
          5 |        378        0.16      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. by drug, sort: tab postest_treat 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |    231,432      100.00      100.00
------------+-----------------------------------
      Total |    231,432      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         93       17.58       17.58
          1 |         90       17.01       34.59
          2 |         88       16.64       51.23
          3 |         81       15.31       66.54
          4 |         79       14.93       81.47
          5 |         98       18.53      100.00
------------+-----------------------------------
      Total |        529      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       17.50       17.50
          1 |         74       13.78       31.28
          2 |        107       19.93       51.21
          3 |         89       16.57       67.78
          4 |         64       11.92       79.70
          5 |        109       20.30      100.00
------------+-----------------------------------
      Total |        537      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         77       15.22       15.22
          1 |         91       17.98       33.20
          2 |         83       16.40       49.60
          3 |         77       15.22       64.82
          4 |         95       18.77       83.60
          5 |         83       16.40      100.00
------------+-----------------------------------
      Total |        506      100.00

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other

postest_tre |
         at |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         90       19.23       19.23
          1 |         67       14.32       33.55
          2 |         76       16.24       49.79
          3 |         75       16.03       65.81
          4 |         72       15.38       81.20
          5 |         88       18.80      100.00
------------+-----------------------------------
      Total |        468      100.00


. replace postest_treat=. if postest_treat<0|postest_treat>7
(0 real changes made)

. gen postest_treat_cat=(postest_treat>=3) if postest_treat<=5

. replace postest_treat_cat=9 if postest_treat_cat==. 
(0 real changes made)

. label define postest_treat_cat 0 "<3 days" 1 "3-5 days"  9 "missing", replace 

. 
. * Demographics*
. * Age
. sum age

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |    233,472    48.85368    18.93715         18        109

. gen age_group=(age>=40)+(age>=60)

. label define age_group 0 "18-39" 1 "40-59" 2 ">=60" 

. label values age_group age_group

. egen age_5y_band=cut(age), at(18,25,30,35,40,45,50,55,60,65,70,75,80,85,110) label

. tab age_group,m

  age_group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |     84,588       36.23       36.23
      40-59 |     78,140       33.47       69.70
       >=60 |     70,744       30.30      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab age_5y_band,m

age_5y_band |      Freq.     Percent        Cum.
------------+-----------------------------------
        18- |     25,272       10.82       10.82
        25- |     19,958        8.55       19.37
        30- |     19,953        8.55       27.92
        35- |     19,405        8.31       36.23
        40- |     17,835        7.64       43.87
        45- |     20,300        8.69       52.56
        50- |     20,993        8.99       61.56
        55- |     19,012        8.14       69.70
        60- |     16,558        7.09       76.79
        65- |     15,290        6.55       83.34
        70- |     14,419        6.18       89.52
        75- |      9,879        4.23       93.75
        80- |      7,499        3.21       96.96
        85- |      7,099        3.04      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. * Sex
. gen male = 1 if sex == "M"
(118,843 missing values generated)

. replace male = 0 if sex == "F"
(118,843 real changes made)

. rename sex sex_str

. gen sex=0 if sex_str=="M"
(118,843 missing values generated)

. replace sex=1 if sex_str=="F"
(118,843 real changes made)

. label define sex 0 "Male" 1 "Female"

. label values sex sex

. * Ethnicity
. tab ethnicity,m

  ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
            |    139,887       59.92       59.92
      Black |      9,488        4.06       63.98
      Mixed |      9,412        4.03       68.01
      Other |      9,395        4.02       72.04
South Asian |      9,346        4.00       76.04
      White |     55,944       23.96      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. rename ethnicity ethnicity_str

. encode  ethnicity_str, gen(ethnicity)

. label list ethnicity                            
ethnicity:
           1 Black
           2 Mixed
           3 Other
           4 South Asian
           5 White

. gen ethnicity_with_missing=ethnicity
(139,887 missing values generated)

. replace ethnicity_with_missing=9 if ethnicity_with_missing==.
(139,887 real changes made)

. gen White=1 if ethnicity==5
(177,528 missing values generated)

. replace White=0 if ethnicity!=5&ethnicity!=.
(37,641 real changes made)

. gen White_with_missing=White
(139,887 missing values generated)

. replace White_with_missing=9 if White==.
(139,887 real changes made)

. * IMD
. tab imd,m

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,343        1.00        1.00
          1 |     46,578       19.95       20.95
          2 |     46,716       20.01       40.96
          3 |     46,644       19.98       60.94
          4 |     46,932       20.10       81.04
          5 |     44,259       18.96      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. replace imd=. if imd==0
(2,343 real changes made, 2,343 to missing)

. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 // Reverse the order (so high is more deprived)
(184485 changes made to imd)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived", replace

. label values imd imd

. gen imd_with_missing=imd
(2,343 missing values generated)

. replace imd_with_missing=9 if imd==.
(2,343 real changes made)

. tab imd

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     44,259       19.15       19.15
               2 |     46,932       20.31       39.45
               3 |     46,644       20.18       59.64
               4 |     46,716       20.21       79.85
 5 most deprived |     46,578       20.15      100.00
-----------------+-----------------------------------
           Total |    231,129      100.00

. * Region
. tab region_nhs,m

              region_nhs |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |     23,266        9.97        9.97
           East Midlands |     23,181        9.93       19.89
                  London |     46,999       20.13       40.02
              North East |     23,245        9.96       49.98
              North West |     23,402       10.02       60.00
              South East |     23,419       10.03       70.03
              South West |     23,283        9.97       80.01
           West Midlands |     23,151        9.92       89.92
Yorkshire and The Humber |     23,526       10.08      100.00
-------------------------+-----------------------------------
                   Total |    233,472      100.00

. rename region_nhs region_nhs_str 

. encode  region_nhs_str, gen(region_nhs)

. label list region_nhs
region_nhs:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab region_covid_therapeutics,m

region_covid_therapeutic |
                       s |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |     23,548       10.09       10.09
           East Midlands |     23,485       10.06       20.15
                  London |     46,754       20.03       40.17
              North East |     23,292        9.98       50.15
              North West |     23,403       10.02       60.17
              South East |     23,449       10.04       70.21
              South West |     23,517       10.07       80.29
           West Midlands |     23,082        9.89       90.17
Yorkshire and The Humber |     22,942        9.83      100.00
-------------------------+-----------------------------------
                   Total |    233,472      100.00

. rename region_covid_therapeutics region_covid_therapeutics_str

. encode region_covid_therapeutics_str, gen(region_covid_therapeutics)

. label list region_covid_therapeutics
region_covid_therapeutics:
           1 East
           2 East Midlands
           3 London
           4 North East
           5 North West
           6 South East
           7 South West
           8 West Midlands
           9 Yorkshire and The Humber

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     23,472       10.05       10.05
      STP10 |     23,320        9.99       20.04
       STP2 |     22,959        9.83       29.88
       STP3 |     23,174        9.93       39.80
       STP4 |     23,478       10.06       49.86
       STP5 |     23,268        9.97       59.82
       STP6 |     23,327        9.99       69.81
       STP7 |     23,546       10.09       79.90
       STP8 |     23,263        9.96       89.86
       STP9 |     23,665       10.14      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. rename stp stp_str

. encode  stp_str,gen(stp)

. label list stp
stp:
           1 STP1
           2 STP10
           3 STP2
           4 STP3
           5 STP4
           6 STP5
           7 STP6
           8 STP7
           9 STP8
          10 STP9

. label values stp stp

. by stp, sort: gen stp_N=_N if stp!=. //combine stps with low N (<100) as "Other"

. replace stp=99 if stp_N<100
(0 real changes made)

. tab stp,m

        stp |      Freq.     Percent        Cum.
------------+-----------------------------------
       STP1 |     23,472       10.05       10.05
      STP10 |     23,320        9.99       20.04
       STP2 |     22,959        9.83       29.88
       STP3 |     23,174        9.93       39.80
       STP4 |     23,478       10.06       49.86
       STP5 |     23,268        9.97       59.82
       STP6 |     23,327        9.99       69.81
       STP7 |     23,546       10.09       79.90
       STP8 |     23,263        9.96       89.86
       STP9 |     23,665       10.14      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. * BMI
. tabstat bmi, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
         bmi |  26.60195  21.55683  27.48409  33.08349 -7.879411  63.53527
--------------------------------------------------------------------------

. replace bmi=. if bmi<10|bmi>60
(14,382 real changes made, 14,382 to missing)

. gen bmi_10y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*10 & (age+((bmi_date_measured-start_date)/365)>=18)
(18,936 missing values generated)

. gen bmi_5y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*5 & (age+((bmi_date_measured-start_date)/365)>=18)
(18,936 missing values generated)

. gen bmi_2y=bmi if bmi_date_measured!=. & bmi_date_measured>=start_date-365*2 & (age+((bmi_date_measured-start_date)/365)>=18)
(59,541 missing values generated)

. gen bmi_group=(bmi>=18.5)+(bmi>=25.0)+(bmi>=30.0) if bmi!=.
(14,382 missing values generated)

. label define bmi_group 0 "underweight" 1 "normal" 2 "overweight" 3 "obese"

. label values bmi_group bmi_group

. gen bmi_group_with_missing=bmi_group
(14,382 missing values generated)

. replace bmi_group_with_missing=9 if bmi_group==.
(14,382 real changes made)

. gen bmi_25=(bmi>=25) if bmi!=.
(14,382 missing values generated)

. gen bmi_30=(bmi>=30) if bmi!=.
(14,382 missing values generated)

. * Comorbidities
. tab diabetes,m

   diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    210,306       90.08       90.08
          1 |     23,166        9.92      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab chronic_cardiac_disease,m

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    210,281       90.07       90.07
          1 |     23,191        9.93      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab hypertension,m

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    210,130       90.00       90.00
          1 |     23,342       10.00      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab chronic_respiratory_disease,m

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    210,078       89.98       89.98
          1 |     23,394       10.02      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. * Vaccination 
. tab vaccination_status,m

       vaccination_status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
Four or more vaccinations |     23,278        9.97        9.97
          One vaccination |     23,611       10.11       20.08
       Three vaccinations |    116,730       50.00       70.08
         Two vaccinations |     23,348       10.00       80.08
            Un-vaccinated |     23,505       10.07       90.15
 Un-vaccinated (declined) |     23,000        9.85      100.00
--------------------------+-----------------------------------
                    Total |    233,472      100.00

. rename vaccination_status vaccination_status_group

. gen vaccination_status=0 if vaccination_status_g=="Un-vaccinated"|vaccination_status_g=="Un-vaccinated (declined)"
(186,967 missing values generated)

. replace vaccination_status=1 if vaccination_status_g=="One vaccination"
(23,611 real changes made)

. replace vaccination_status=2 if vaccination_status_g=="Two vaccinations"
(23,348 real changes made)

. replace vaccination_status=3 if vaccination_status_g=="Three vaccinations"
(116,730 real changes made)

. replace vaccination_status=4 if vaccination_status_g=="Four or more vaccinations"
(23,278 real changes made)

. label define vaccination_status 0 "Un-vaccinated" 1 "One vaccination" 2 "Two vaccinations" 3 "Three vaccinations" 4 "Four or more vaccinations"

. label values vaccination_status vaccination_status

. gen vaccination_3_plus=1 if vaccination_status==3|vaccination_status==4
(93,464 missing values generated)

. replace vaccination_3_plus=0 if vaccination_status<3
(93,464 real changes made)

. gen days_vacc_covid=covid_test_positive_date - last_vaccination_date
(11,793 missing values generated)

. sum days_vacc_covid,de

                       days_vacc_covid
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -403           -504
 5%         -276           -504
10%         -180           -503       Obs             221,679
25%           10           -503       Sum of wgt.     221,679

50%          276                      Mean           275.4127
                        Largest       Std. dev.       339.279
75%          540           1054
90%          731           1055       Variance       115110.3
95%          827           1055       Skewness        .001102
99%          955           1056       Kurtosis       2.160963

. gen month_vacc_covid=ceil(days_vacc_covid/30)
(11,793 missing values generated)

. tab month_vacc_covid,m

month_vacc_ |
      covid |      Freq.     Percent        Cum.
------------+-----------------------------------
        -16 |        174        0.07        0.07
        -15 |        531        0.23        0.30
        -14 |        881        0.38        0.68
        -13 |      1,236        0.53        1.21
        -12 |      1,679        0.72        1.93
        -11 |      2,028        0.87        2.80
        -10 |      2,342        1.00        3.80
         -9 |      2,803        1.20        5.00
         -8 |      3,203        1.37        6.37
         -7 |      3,547        1.52        7.89
         -6 |      3,867        1.66        9.55
         -5 |      4,241        1.82       11.36
         -4 |      4,697        2.01       13.38
         -3 |      5,038        2.16       15.53
         -2 |      5,274        2.26       17.79
         -1 |      5,797        2.48       20.28
          0 |      6,224        2.67       22.94
          1 |      6,140        2.63       25.57
          2 |      6,258        2.68       28.25
          3 |      6,361        2.72       30.98
          4 |      6,293        2.70       33.67
          5 |      6,191        2.65       36.32
          6 |      6,298        2.70       39.02
          7 |      6,184        2.65       41.67
          8 |      6,198        2.65       44.32
          9 |      6,200        2.66       46.98
         10 |      6,280        2.69       49.67
         11 |      6,166        2.64       52.31
         12 |      6,388        2.74       55.05
         13 |      6,312        2.70       57.75
         14 |      6,317        2.71       60.46
         15 |      6,207        2.66       63.11
         16 |      6,288        2.69       65.81
         17 |      6,319        2.71       68.51
         18 |      6,449        2.76       71.28
         19 |      6,217        2.66       73.94
         20 |      5,957        2.55       76.49
         21 |      5,322        2.28       78.77
         22 |      5,048        2.16       80.93
         23 |      4,643        1.99       82.92
         24 |      4,447        1.90       84.83
         25 |      4,015        1.72       86.55
         26 |      3,533        1.51       88.06
         27 |      3,318        1.42       89.48
         28 |      2,879        1.23       90.71
         29 |      2,521        1.08       91.79
         30 |      2,104        0.90       92.69
         31 |      1,874        0.80       93.50
         32 |      1,398        0.60       94.10
         33 |      1,031        0.44       94.54
         34 |        668        0.29       94.82
         35 |        280        0.12       94.94
         36 |         13        0.01       94.95
          . |     11,793        5.05      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. *Calendar time*
. gen day_after_campaign=start_date-mdy(12,15,2021)

. sum day_after_campaign,de

                     day_after_campaign
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3             -1
 5%           23             -1
10%           49             -1       Obs             233,472
25%          125             -1       Sum of wgt.     233,472

50%          252                      Mean           251.8909
                        Largest       Std. dev.      146.6702
75%          379            505
90%          455            505       Variance       21512.13
95%          480            505       Skewness      -.0011284
99%          500            505       Kurtosis       1.798102

. gen month_after_campaign=ceil((start_date-mdy(12,15,2021))/30)

. tab month_after_campaign,m

month_after |
  _campaign |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,138        0.49        0.49
          1 |     13,908        5.96        6.44
          2 |     13,737        5.88       12.33
          3 |     13,710        5.87       18.20
          4 |     13,856        5.93       24.14
          5 |     13,828        5.92       30.06
          6 |     13,779        5.90       35.96
          7 |     13,898        5.95       41.91
          8 |     13,742        5.89       47.80
          9 |     13,650        5.85       53.64
         10 |     13,766        5.90       59.54
         11 |     13,766        5.90       65.44
         12 |     13,771        5.90       71.34
         13 |     13,811        5.92       77.25
         14 |     13,802        5.91       83.16
         15 |     13,784        5.90       89.07
         16 |     14,029        6.01       95.08
         17 |     11,497        4.92      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. mkspline calendar_day_spline = day_after_campaign, cubic nknots(4)

. * Variant
. tab sgtf,m

       sgtf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    163,144       69.88       69.88
          1 |     23,243        9.96       79.83
          9 |     23,464       10.05       89.88
          . |     23,621       10.12      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab sgtf_new, m

   sgtf_new |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    163,305       69.95       69.95
          1 |     23,278        9.97       79.92
          9 |     23,575       10.10       90.01
          . |     23,314        9.99      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. label define sgtf_new 0 "S gene detected" 1 "confirmed SGTF" 9 "NA"

. label values sgtf_new sgtf_new

. tab variant_recorded,m

variant_reco |
        rded |      Freq.     Percent        Cum.
-------------+-----------------------------------
             |     23,764       10.18       10.18
   B.1.617.2 |    162,996       69.81       79.99
VOC-21JAN-02 |     46,712       20.01      100.00
-------------+-----------------------------------
       Total |    233,472      100.00

. tab sgtf_new variant_recorded ,m

                |         variant_recorded
       sgtf_new |            B.1.617.2  VOC-21J.. |     Total
----------------+---------------------------------+----------
S gene detected |    16,643    114,030     32,632 |   163,305 
 confirmed SGTF |     2,340     16,251      4,687 |    23,278 
             NA |     2,358     16,533      4,684 |    23,575 
              . |     2,423     16,182      4,709 |    23,314 
----------------+---------------------------------+----------
          Total |    23,764    162,996     46,712 |   233,472 

. * Prior infection
. gen prior_infection=(covid_test_positive_pre_date<=(covid_test_positive_date-30) & covid_test_positive_pre_date >mdy(1,1,2020) & covid_test_positive_pre_date!=.)

. tab prior_infection,m

prior_infec |
       tion |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    212,029       90.82       90.82
          1 |     21,443        9.18      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. *Contraindications for Pax*
. tab drug if solid_organ==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     72,444       99.10       99.10
  sotrovimab |        174        0.24       99.34
    paxlovid |        160        0.22       99.56
molnupiravir |        172        0.24       99.80
       other |        149        0.20      100.00
-------------+-----------------------------------
       Total |     73,099      100.00

. tab drug if liver_disease_nhsd_icd10==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     23,216       99.06       99.06
  sotrovimab |         48        0.20       99.26
    paxlovid |         62        0.26       99.53
molnupiravir |         63        0.27       99.80
       other |         48        0.20      100.00
-------------+-----------------------------------
       Total |     23,437      100.00

. tab drug if renal_disease==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     79,330       99.10       99.10
  sotrovimab |        207        0.26       99.36
    paxlovid |        177        0.22       99.58
molnupiravir |        173        0.22       99.80
       other |        160        0.20      100.00
-------------+-----------------------------------
       Total |     80,047      100.00

. * Calculating egfr: adapted from https://github.com/opensafely/COVID-19-vaccine-breakthrough/blob/updates-feb/analysis/data_process.R*
. tab creatinine_operator_ctv3,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     23,092        9.89        9.89
          < |     11,688        5.01       14.90
         <= |     11,762        5.04       19.93
          = |    152,041       65.12       85.06
          > |     11,577        4.96       90.02
         >= |     11,612        4.97       94.99
          ~ |     11,700        5.01      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  57.00737  47.88756  59.02175  69.50688 -8.659293  125.5207
--------------------------------------------------------------------------

. replace creatinine_ctv3=. if !inrange(creatinine_ctv3, 20, 3000)|creatinine_ctv3_date>start_date
(114,236 real changes made, 114,236 to missing)

. tabstat creatinine_ctv3, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
creat~e_ctv3 |  60.18385  49.94498   60.1011  70.21335  20.02849  125.2254
--------------------------------------------------------------------------

. tab creatinine_operator_ctv3 if creatinine_ctv3!=.,m

creatinine_ |
operator_ct |
         v3 |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     11,803        9.90        9.90
          < |      5,858        4.91       14.81
         <= |      6,079        5.10       19.91
          = |     77,704       65.17       85.08
          > |      5,908        4.95       90.03
         >= |      5,959        5.00       95.03
          ~ |      5,925        4.97      100.00
------------+-----------------------------------
      Total |    119,236      100.00

. replace creatinine_ctv3 = creatinine_ctv3/88.4
(119,236 real changes made)

. gen min_creatinine_ctv3=.
(233,472 missing values generated)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.7)^-0.329 if sex==1
(60,738 real changes made)

. replace min_creatinine_ctv3 = (creatinine_ctv3/0.9)^-0.411 if sex==0
(58,498 real changes made)

. replace min_creatinine_ctv3 = 1 if min_creatinine_ctv3<1
(33,224 real changes made)

. gen max_creatinine_ctv3=.
(233,472 missing values generated)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.7)^-1.209 if sex==1
(60,738 real changes made)

. replace max_creatinine_ctv3 = (creatinine_ctv3/0.9)^-1.209 if sex==0
(58,498 real changes made)

. replace max_creatinine_ctv3 = 1 if max_creatinine_ctv3>1
(200,248 real changes made)

. gen egfr_creatinine_ctv3 = min_creatinine_ctv3*max_creatinine_ctv3*141*(0.993^age_creatinine_ctv3) if age_creatinine_ctv3>0&age_creatinine_ctv3<=120
(115,601 missing values generated)

. replace egfr_creatinine_ctv3 = egfr_creatinine_ctv3*1.018 if sex==1
(60,045 real changes made)

. tab creatinine_operator_snomed,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     23,541       10.08       10.08
          < |     11,750        5.03       15.12
         <= |     11,646        4.99       20.10
          = |    151,475       64.88       84.98
          > |     11,679        5.00       89.99
         >= |     11,727        5.02       95.01
          ~ |     11,654        4.99      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab creatinine_operator_snomed if creatinine_snomed!=.,m

creatinine_ |
operator_sn |
       omed |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     23,541       10.08       10.08
          < |     11,750        5.03       15.12
         <= |     11,646        4.99       20.10
          = |    151,475       64.88       84.98
          > |     11,679        5.00       89.99
         >= |     11,727        5.02       95.01
          ~ |     11,654        4.99      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tabstat creatinine_snomed, stat(mean p25 p50 p75 min max) 

    Variable |      Mean       p25       p50       p75       Min       Max
-------------+------------------------------------------------------------
cre~e_snomed |  22.51387         0         0  45.00369 -43.88654  127.3469
--------------------------------------------------------------------------

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(177,092 real changes made, 177,092 to missing)

. replace creatinine_snomed_date = creatinine_short_snomed_date if missing(creatinine_snomed)
(118,971 real changes made, 30,293 to missing)

. replace creatinine_operator_snomed = creatinine_operator_short_snomed if missing(creatinine_snomed)
(98,274 real changes made)

. replace age_creatinine_snomed = age_creatinine_short_snomed if missing(creatinine_snomed)
(175,005 real changes made)

. replace creatinine_snomed = creatinine_short_snomed if missing(creatinine_snomed)
(177,092 real changes made)

. replace creatinine_snomed = . if !inrange(creatinine_snomed, 20, 3000)| creatinine_snomed_date>start_date
(137,606 real changes made, 137,606 to missing)

. replace creatinine_snomed = creatinine_snomed/88.4
(95,866 real changes made)

. gen min_creatinine_snomed=.
(233,472 missing values generated)

. replace min_creatinine_snomed = (creatinine_snomed/0.7)^-0.329 if sex==1
(48,724 real changes made)

. replace min_creatinine_snomed = (creatinine_snomed/0.9)^-0.411 if sex==0
(47,142 real changes made)

. replace min_creatinine_snomed = 1 if min_creatinine_snomed<1
(12,935 real changes made)

. gen max_creatinine_snomed=.
(233,472 missing values generated)

. replace max_creatinine_snomed = (creatinine_snomed/0.7)^-1.209 if sex==1
(48,724 real changes made)

. replace max_creatinine_snomed = (creatinine_snomed/0.9)^-1.209 if sex==0
(47,142 real changes made)

. replace max_creatinine_snomed = 1 if max_creatinine_snomed>1
(220,537 real changes made)

. gen egfr_creatinine_snomed = min_creatinine_snomed*max_creatinine_snomed*141*(0.993^age_creatinine_snomed) if age_creatinine_snomed>0&age_creatinine_snomed<=120
(138,789 missing values generated)

. replace egfr_creatinine_snomed = egfr_creatinine_snomed*1.018 if sex==1
(48,112 real changes made)

. tab egfr_operator if egfr_record!=.,m

eGFR_operat |
         or |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     23,392       10.02       10.02
          < |     11,744        5.03       15.05
         <= |     11,734        5.03       20.08
          = |    151,309       64.81       84.88
          > |     11,698        5.01       89.89
         >= |     11,806        5.06       94.95
          ~ |     11,789        5.05      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. tab egfr_short_operator if egfr_short_record!=.,m

eGFR_short_ |
   operator |      Freq.     Percent        Cum.
------------+-----------------------------------
            |     23,459       10.05       10.05
          < |     11,679        5.00       15.05
         <= |     11,566        4.95       20.00
          = |    151,835       65.03       85.04
          > |     11,645        4.99       90.03
         >= |     11,735        5.03       95.05
          ~ |     11,553        4.95      100.00
------------+-----------------------------------
      Total |    233,472      100.00

. gen egfr_60 = 1 if (egfr_creatinine_ctv3<60&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<60&creatinine_operator_snomed!="<")|(egfr_record<60&egfr_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<60&e
> gfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(202,962 missing values generated)

. gen egfr_30 = 1 if (egfr_creatinine_ctv3<30&creatinine_operator_ctv3!="<")|(egfr_creatinine_snomed<30&creatinine_operator_snomed!="<")|(egfr_record<30&egfr_record>0&egfr_operator!=">"&egfr_operator!=">=")|(egfr_short_record<30&e
> gfr_short_record>0&egfr_short_operator!=">"&egfr_short_operator!=">=")
(226,638 missing values generated)

. tab drug if egfr_60==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |     30,249       99.14       99.14
  sotrovimab |         72        0.24       99.38
    paxlovid |         63        0.21       99.59
molnupiravir |         69        0.23       99.81
       other |         57        0.19      100.00
-------------+-----------------------------------
       Total |     30,510      100.00

. tab drug if egfr_30==1

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,786       99.30       99.30
  sotrovimab |         14        0.20       99.50
    paxlovid |         12        0.18       99.68
molnupiravir |         15        0.22       99.90
       other |          7        0.10      100.00
-------------+-----------------------------------
       Total |      6,834      100.00

. *drug interactions*
. tab drug if drugs_do_not_use<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,220       99.79       99.79
  sotrovimab |          3        0.05       99.84
    paxlovid |          4        0.06       99.90
molnupiravir |          5        0.08       99.98
       other |          1        0.02      100.00
-------------+-----------------------------------
       Total |      6,233      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,220       99.79       99.79
  sotrovimab |          3        0.05       99.84
    paxlovid |          4        0.06       99.90
molnupiravir |          5        0.08       99.98
       other |          1        0.02      100.00
-------------+-----------------------------------
       Total |      6,233      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      5,520       99.77       99.77
  sotrovimab |          3        0.05       99.82
    paxlovid |          4        0.07       99.89
molnupiravir |          5        0.09       99.98
       other |          1        0.02      100.00
-------------+-----------------------------------
       Total |      5,533      100.00

. tab drug if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,443       99.65       99.65
  sotrovimab |          2        0.06       99.71
    paxlovid |          4        0.12       99.83
molnupiravir |          5        0.14       99.97
       other |          1        0.03      100.00
-------------+-----------------------------------
       Total |      3,455      100.00

. tab drug if drugs_consider_risk<=start_date

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,208       99.63       99.63
  sotrovimab |          5        0.08       99.71
    paxlovid |         10        0.16       99.87
molnupiravir |          4        0.06       99.94
       other |          4        0.06      100.00
-------------+-----------------------------------
       Total |      6,231      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-3*365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      6,208       99.63       99.63
  sotrovimab |          5        0.08       99.71
    paxlovid |         10        0.16       99.87
molnupiravir |          4        0.06       99.94
       other |          4        0.06      100.00
-------------+-----------------------------------
       Total |      6,231      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-365.25)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      5,501       99.58       99.58
  sotrovimab |          5        0.09       99.67
    paxlovid |         10        0.18       99.86
molnupiravir |          4        0.07       99.93
       other |          4        0.07      100.00
-------------+-----------------------------------
       Total |      5,524      100.00

. tab drug if drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180)

        drug |      Freq.     Percent        Cum.
-------------+-----------------------------------
     control |      3,350       99.35       99.35
  sotrovimab |          5        0.15       99.50
    paxlovid |          9        0.27       99.76
molnupiravir |          4        0.12       99.88
       other |          4        0.12      100.00
-------------+-----------------------------------
       Total |      3,372      100.00

. gen drugs_do_not_use_contra=(drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180))  // Are these CI drug for paxlovid only??

. gen drugs_consider_risk_contra=(drugs_consider_risk<=start_date&drugs_consider_risk>=(start_date-180))

. * Drug contraindicated 
. gen paxlovid_contra = 1 if egfr_30==1 | dialysis==1
(204,009 missing values generated)

. replace paxlovid_contra = 1 if liver_disease==1 
(38,713 real changes made)

. replace paxlovid_contra = 1 if solid_organ==1 
(51,675 real changes made)

. replace paxlovid_contra = 1 if drugs_do_not_use<=start_date&drugs_do_not_use>=(start_date-180)
(1,679 real changes made)

. recode paxlovid_contra . = 0
(111942 changes made to paxlovid_contra)

. by drug, sort: count if paxlovid_contra==1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  120,476
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  274
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  267
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  271
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = other
  242

. 
. 
. ****************************
. *       COX MODEL               *
. ****************************
. drop if drug==4 // removing those on casirivimab or remdesivir as first drug after covid test
(468 observations deleted)

. rename covid_hosp_date covid_hosp

. rename all_hosp_date all_hosp

. rename died_date_ons died

. 
. * Generate failure 
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed new_ae_psa_snomed new_ae_ankspon_ctv ///
>                                            new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{
  2.         display "`var'"
  3.         by drug, sort: count if `var'!=.
  4.         by drug, sort: count if `var'<start_date & `var' 
  5.         replace `var'=. if `var'<start_date & `var'!=.
  6.         gen fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==1
  7.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==2
  8.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, paxlovid_d, remdesivir_d, casirivimab_d)) if drug==3
  9.         replace fail_`var'=(`var'!=.&`var'<= min(study_end_date, start_date_29, sotrovimab_d, paxlovid_d, molnupiravir_d, remdesivir_d, casirivimab_d)) if drug==0
 10.         tab drug fail_`var', m
 11. }
ae_spc_gp

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  7,679
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  14
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  21
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  16

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |    fail_ae_spc_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   223,769      7,663 |   231,432 
  sotrovimab |       515         14 |       529 
    paxlovid |       516         21 |       537 
molnupiravir |       490         16 |       506 
-------------+----------------------+----------
       Total |   225,290      7,714 |   233,004 
ae_spc_serious

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  5,202
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  11
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  8

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |  fail_ae_spc_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   226,242      5,190 |   231,432 
  sotrovimab |       523          6 |       529 
    paxlovid |       526         11 |       537 
molnupiravir |       498          8 |       506 
-------------+----------------------+----------
       Total |   227,789      5,215 |   233,004 
ae_spc_all

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  12,683
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  20
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  32
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  24

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |    fail_ae_spc_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   218,777     12,655 |   231,432 
  sotrovimab |       509         20 |       529 
    paxlovid |       505         32 |       537 
molnupiravir |       482         24 |       506 
-------------+----------------------+----------
       Total |   220,273     12,731 |   233,004 
ae_imae_gp

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  13,102
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  33
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  32
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  25

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |    fail_ae_imae_gp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   218,357     13,075 |   231,432 
  sotrovimab |       496         33 |       529 
    paxlovid |       505         32 |       537 
molnupiravir |       481         25 |       506 
-------------+----------------------+----------
       Total |   219,839     13,165 |   233,004 
ae_imae_serious

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,301
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  12

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_ae_imae_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   227,142      4,290 |   231,432 
  sotrovimab |       523          6 |       529 
    paxlovid |       532          5 |       537 
molnupiravir |       494         12 |       506 
-------------+----------------------+----------
       Total |   228,691      4,313 |   233,004 
ae_imae_all

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  17,148
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  38
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  37
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  37

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |   fail_ae_imae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   214,321     17,111 |   231,432 
  sotrovimab |       491         38 |       529 
    paxlovid |       500         37 |       537 
molnupiravir |       469         37 |       506 
-------------+----------------------+----------
       Total |   215,781     17,223 |   233,004 
ae_all

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  28,799
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  56
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  67
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  58

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |      fail_ae_all
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   202,698     28,734 |   231,432 
  sotrovimab |       473         56 |       529 
    paxlovid |       470         67 |       537 
molnupiravir |       448         58 |       506 
-------------+----------------------+----------
       Total |   204,089     28,915 |   233,004 
ae_all_serious

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  9,389
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  12
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  16
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  20

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |  fail_ae_all_serious
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   222,066      9,366 |   231,432 
  sotrovimab |       517         12 |       529 
    paxlovid |       521         16 |       537 
molnupiravir |       486         20 |       506 
-------------+----------------------+----------
       Total |   223,590      9,414 |   233,004 
ae_diverticulitis_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,555
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  9

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_ae_diverticuliti
             |       s_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   228,880      2,552 |   231,432 
  sotrovimab |       524          5 |       529 
    paxlovid |       531          6 |       537 
molnupiravir |       497          9 |       506 
-------------+----------------------+----------
       Total |   230,432      2,572 |   233,004 
ae_diarrhoea_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,610
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_ae_diarrhoea_sno
             |          med
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   228,829      2,603 |   231,432 
  sotrovimab |       524          5 |       529 
    paxlovid |       528          9 |       537 
molnupiravir |       503          3 |       506 
-------------+----------------------+----------
       Total |   230,384      2,620 |   233,004 
ae_taste_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,600
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_ae_taste_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   228,839      2,593 |   231,432 
  sotrovimab |       525          4 |       529 
    paxlovid |       531          6 |       537 
molnupiravir |       502          4 |       506 
-------------+----------------------+----------
       Total |   230,397      2,607 |   233,004 
ae_diverticulitis_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,664
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  7
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_ae_diverticuliti
             |         s_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   228,773      2,659 |   231,432 
  sotrovimab |       526          3 |       529 
    paxlovid |       530          7 |       537 
molnupiravir |       505          1 |       506 
-------------+----------------------+----------
       Total |   230,334      2,670 |   233,004 
ae_taste_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,567
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |   fail_ae_taste_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   228,872      2,560 |   231,432 
  sotrovimab |       525          4 |       529 
    paxlovid |       533          4 |       537 
molnupiravir |       499          7 |       506 
-------------+----------------------+----------
       Total |   230,429      2,575 |   233,004 
new_ae_ra_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,081
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_new_ae_ra_snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,358      2,074 |   231,432 
  sotrovimab |       523          6 |       529 
    paxlovid |       533          4 |       537 
molnupiravir |       499          7 |       506 
-------------+----------------------+----------
       Total |   230,913      2,091 |   233,004 
new_ae_sle_ctv

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,065
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  4
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |  fail_new_ae_sle_ctv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,371      2,061 |   231,432 
  sotrovimab |       524          5 |       529 
    paxlovid |       533          4 |       537 
molnupiravir |       501          5 |       506 
-------------+----------------------+----------
       Total |   230,929      2,075 |   233,004 
new_ae_psoriasis_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,302
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  8
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_new_ae_psoriasis
             |        _snomed
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,134      2,298 |   231,432 
  sotrovimab |       521          8 |       529 
    paxlovid |       532          5 |       537 
molnupiravir |       499          7 |       506 
-------------+----------------------+----------
       Total |   230,686      2,318 |   233,004 
new_ae_psa_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,331
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_new_ae_psa_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,105      2,327 |   231,432 
  sotrovimab |       524          5 |       529 
    paxlovid |       531          6 |       537 
molnupiravir |       505          1 |       506 
-------------+----------------------+----------
       Total |   230,665      2,339 |   233,004 
new_ae_ankspon_ctv

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,361
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  3
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  6
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  1

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_new_ae_ankspon_c
             |          tv
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,076      2,356 |   231,432 
  sotrovimab |       526          3 |       529 
    paxlovid |       531          6 |       537 
molnupiravir |       505          1 |       506 
-------------+----------------------+----------
       Total |   230,638      2,366 |   233,004 
new_ae_ibd_snomed

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,312
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  8
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  4

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             | fail_new_ae_ibd_snome
             |           d
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,123      2,309 |   231,432 
  sotrovimab |       521          8 |       529 
    paxlovid |       528          9 |       537 
molnupiravir |       502          4 |       506 
-------------+----------------------+----------
       Total |   230,674      2,330 |   233,004 
new_ae_ra_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,207
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  3
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  7

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |  fail_new_ae_ra_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,230      2,202 |   231,432 
  sotrovimab |       528          1 |       529 
    paxlovid |       534          3 |       537 
molnupiravir |       499          7 |       506 
-------------+----------------------+----------
       Total |   230,791      2,213 |   233,004 
new_ae_sle_icd

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  2,118
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  5
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  5

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |  fail_new_ae_sle_icd
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   229,320      2,112 |   231,432 
  sotrovimab |       524          5 |       529 
    paxlovid |       535          2 |       537 
molnupiravir |       501          5 |       506 
-------------+----------------------+----------
       Total |   230,880      2,124 |   233,004 
covid_hosp

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,341
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  2
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |    fail_covid_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   230,094      1,338 |   231,432 
  sotrovimab |       527          2 |       529 
    paxlovid |       537          0 |       537 
molnupiravir |       503          3 |       506 
-------------+----------------------+----------
       Total |   231,661      1,343 |   233,004 
all_hosp

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  1,346
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  1
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  2
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  3

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |     fail_all_hosp
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   230,087      1,345 |   231,432 
  sotrovimab |       528          1 |       529 
    paxlovid |       535          2 |       537 
molnupiravir |       503          3 |       506 
-------------+----------------------+----------
       Total |   231,653      1,351 |   233,004 
died

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  4,652
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  9
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  9
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  9

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = control
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = sotrovimab
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = paxlovid
  0
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> drug = molnupiravir
  0
(0 real changes made)
(232,475 missing values generated)
(537 real changes made)
(506 real changes made)
(231,432 real changes made)

             |       fail_died
        drug |         0          1 |     Total
-------------+----------------------+----------
     control |   226,785      4,647 |   231,432 
  sotrovimab |       520          9 |       529 
    paxlovid |       528          9 |       537 
molnupiravir |       497          9 |       506 
-------------+----------------------+----------
       Total |   228,330      4,674 |   233,004 

. * Add half-day buffer if outcome on indexdate
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed new_ae_psa_snomed new_ae_ankspon_ctv ///
>                                            new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{    
  2.         display "`var'"
  3.         replace `var'=`var'+0.5 if `var'==start_date
  4. }
ae_spc_gp
(257 real changes made)
ae_spc_serious
(190 real changes made)
ae_spc_all
(447 real changes made)
ae_imae_gp
(493 real changes made)
ae_imae_serious
(150 real changes made)
ae_imae_all
(643 real changes made)
ae_all
(1,090 real changes made)
ae_all_serious
(340 real changes made)
ae_diverticulitis_snomed
(79 real changes made)
ae_diarrhoea_snomed
(90 real changes made)
ae_taste_snomed
(88 real changes made)
ae_diverticulitis_icd
(102 real changes made)
ae_taste_icd
(88 real changes made)
new_ae_ra_snomed
(78 real changes made)
new_ae_sle_ctv
(80 real changes made)
new_ae_psoriasis_snomed
(79 real changes made)
new_ae_psa_snomed
(83 real changes made)
new_ae_ankspon_ctv
(91 real changes made)
new_ae_ibd_snomed
(83 real changes made)
new_ae_ra_icd
(82 real changes made)
new_ae_sle_icd
(68 real changes made)
covid_hosp
(55 real changes made)
all_hosp
(41 real changes made)
died
(184 real changes made)

. *Generate censor date
. foreach var of varlist ae_spc* ae_imae* ae_all* ae_diverticulitis_snomed ae_diarrhoea_snomed ae_taste_snomed ae_diverticulitis_icd ///
>                                            ae_taste_icd new_ae_ra_snomed new_ae_sle_ctv new_ae_psoriasis_snomed new_ae_psa_snomed new_ae_ankspon_ctv ///
>                                            new_ae_ibd new_ae_ra_icd new_ae_sle_icd covid_hosp all_hosp died{    
  2.         gen stop_`var'=`var' if fail_`var'==1
  3.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==1
  4.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==2
  5.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==3
  6.         replace stop_`var'=min(death_date,dereg_date,study_end_date,start_date_29,sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d) if fail_`var'==0&drug==0
  7.         format %td stop_`var'
  8. }
(225,290 missing values generated)
(515 real changes made)
(516 real changes made)
(490 real changes made)
(223,769 real changes made)
(227,789 missing values generated)
(523 real changes made)
(526 real changes made)
(498 real changes made)
(226,242 real changes made)
(220,273 missing values generated)
(509 real changes made)
(505 real changes made)
(482 real changes made)
(218,777 real changes made)
(219,839 missing values generated)
(496 real changes made)
(505 real changes made)
(481 real changes made)
(218,357 real changes made)
(228,691 missing values generated)
(523 real changes made)
(532 real changes made)
(494 real changes made)
(227,142 real changes made)
(215,781 missing values generated)
(491 real changes made)
(500 real changes made)
(469 real changes made)
(214,321 real changes made)
(204,089 missing values generated)
(473 real changes made)
(470 real changes made)
(448 real changes made)
(202,698 real changes made)
(223,590 missing values generated)
(517 real changes made)
(521 real changes made)
(486 real changes made)
(222,066 real changes made)
(230,432 missing values generated)
(524 real changes made)
(531 real changes made)
(497 real changes made)
(228,880 real changes made)
(230,384 missing values generated)
(524 real changes made)
(528 real changes made)
(503 real changes made)
(228,829 real changes made)
(230,397 missing values generated)
(525 real changes made)
(531 real changes made)
(502 real changes made)
(228,839 real changes made)
(230,334 missing values generated)
(526 real changes made)
(530 real changes made)
(505 real changes made)
(228,773 real changes made)
(230,429 missing values generated)
(525 real changes made)
(533 real changes made)
(499 real changes made)
(228,872 real changes made)
(230,913 missing values generated)
(523 real changes made)
(533 real changes made)
(499 real changes made)
(229,358 real changes made)
(230,929 missing values generated)
(524 real changes made)
(533 real changes made)
(501 real changes made)
(229,371 real changes made)
(230,686 missing values generated)
(521 real changes made)
(532 real changes made)
(499 real changes made)
(229,134 real changes made)
(230,665 missing values generated)
(524 real changes made)
(531 real changes made)
(505 real changes made)
(229,105 real changes made)
(230,638 missing values generated)
(526 real changes made)
(531 real changes made)
(505 real changes made)
(229,076 real changes made)
(230,674 missing values generated)
(521 real changes made)
(528 real changes made)
(502 real changes made)
(229,123 real changes made)
(230,791 missing values generated)
(528 real changes made)
(534 real changes made)
(499 real changes made)
(229,230 real changes made)
(230,880 missing values generated)
(524 real changes made)
(535 real changes made)
(501 real changes made)
(229,320 real changes made)
(231,661 missing values generated)
(527 real changes made)
(537 real changes made)
(503 real changes made)
(230,094 real changes made)
(231,653 missing values generated)
(528 real changes made)
(535 real changes made)
(503 real changes made)
(230,087 real changes made)
(228,330 missing values generated)
(520 real changes made)
(528 real changes made)
(497 real changes made)
(226,785 real changes made)

. 
. * Follow-up time
. stset stop_ae_all, id(patient_id) origin(time start_date) enter(time start_date) failure(fail_ae_all==1) 

Survival-time data settings

           ID variable: patient_id
         Failure event: fail_ae_all==1
Observed time interval: (stop_ae_all[_n-1], stop_ae_all]
     Enter on or after: time start_date
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: time start_date

--------------------------------------------------------------------------
    233,004  total observations
        245  observations end on or before enter()
--------------------------------------------------------------------------
    232,759  observations remaining, representing
    232,759  subjects
     28,915  failures in single-failure-per-subject data
  6,083,611  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        28

. *count censored due to second therapy*
. count if fail_ae_all==0&drug==0&min(sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  519

. count if fail_ae_all==0&drug==1&min(paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  2

. count if fail_ae_all==0&drug==2&min(sotrovimab_d,molnupiravir_d,remdesivir_d,casirivimab_d)==stop_ae_all
  1

. count if fail_ae_all==0&drug==3&min(sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d)==stop_ae_all
  1

. // keep if _st==1 -> observations end on or before enter -> should be 0 in actual dataset
. tab _t,m

   Analysis |
  time when |
record ends |      Freq.     Percent        Cum.
------------+-----------------------------------
         .5 |      1,088        0.47        0.47
          1 |      1,310        0.56        1.03
          2 |      1,273        0.55        1.58
          3 |      1,234        0.53        2.11
          4 |      1,080        0.46        2.57
          5 |      1,105        0.47        3.04
          6 |      1,018        0.44        3.48
          7 |      1,028        0.44        3.92
          8 |      1,028        0.44        4.36
          9 |      1,031        0.44        4.80
         10 |      1,029        0.44        5.25
         11 |      1,039        0.45        5.69
         12 |      1,005        0.43        6.12
         13 |      1,064        0.46        6.58
         14 |        977        0.42        7.00
         15 |      1,013        0.43        7.43
         16 |        929        0.40        7.83
         17 |        968        0.42        8.25
         18 |        962        0.41        8.66
         19 |        964        0.41        9.07
         20 |        959        0.41        9.49
         21 |        974        0.42        9.90
         22 |        894        0.38       10.29
         23 |        959        0.41       10.70
         24 |        886        0.38       11.08
         25 |        947        0.41       11.49
         26 |        918        0.39       11.88
         27 |        901        0.39       12.27
         28 |    204,176       87.63       99.89
          . |        245        0.11      100.00
------------+-----------------------------------
      Total |    233,004      100.00

. tab _t drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |     1,080          1          6          1 |     1,088 
           |      0.47       0.19       1.12       0.20 |      0.47 
-----------+--------------------------------------------+----------
         1 |     1,303          0          3          4 |     1,310 
           |      0.56       0.00       0.56       0.79 |      0.56 
-----------+--------------------------------------------+----------
         2 |     1,267          1          2          3 |     1,273 
           |      0.55       0.19       0.37       0.59 |      0.55 
-----------+--------------------------------------------+----------
         3 |     1,225          3          3          3 |     1,234 
           |      0.53       0.57       0.56       0.59 |      0.53 
-----------+--------------------------------------------+----------
         4 |     1,075          1          3          1 |     1,080 
           |      0.46       0.19       0.56       0.20 |      0.46 
-----------+--------------------------------------------+----------
         5 |     1,099          4          0          2 |     1,105 
           |      0.47       0.76       0.00       0.40 |      0.47 
-----------+--------------------------------------------+----------
         6 |     1,013          0          2          3 |     1,018 
           |      0.44       0.00       0.37       0.59 |      0.44 
-----------+--------------------------------------------+----------
         7 |     1,019          3          2          4 |     1,028 
           |      0.44       0.57       0.37       0.79 |      0.44 
-----------+--------------------------------------------+----------
         8 |     1,020          2          4          2 |     1,028 
           |      0.44       0.38       0.74       0.40 |      0.44 
-----------+--------------------------------------------+----------
         9 |     1,026          3          0          2 |     1,031 
           |      0.44       0.57       0.00       0.40 |      0.44 
-----------+--------------------------------------------+----------
        10 |     1,022          4          2          1 |     1,029 
           |      0.44       0.76       0.37       0.20 |      0.44 
-----------+--------------------------------------------+----------
        11 |     1,031          3          4          1 |     1,039 
           |      0.45       0.57       0.74       0.20 |      0.45 
-----------+--------------------------------------------+----------
        12 |     1,001          1          3          0 |     1,005 
           |      0.43       0.19       0.56       0.00 |      0.43 
-----------+--------------------------------------------+----------
        13 |     1,055          2          5          2 |     1,064 
           |      0.46       0.38       0.93       0.40 |      0.46 
-----------+--------------------------------------------+----------
        14 |       975          1          0          1 |       977 
           |      0.42       0.19       0.00       0.20 |      0.42 
-----------+--------------------------------------------+----------
        15 |     1,006          3          0          4 |     1,013 
           |      0.43       0.57       0.00       0.79 |      0.43 
-----------+--------------------------------------------+----------
        16 |       919          4          2          4 |       929 
           |      0.40       0.76       0.37       0.79 |      0.40 
-----------+--------------------------------------------+----------
        17 |       964          1          1          2 |       968 
           |      0.42       0.19       0.19       0.40 |      0.42 
-----------+--------------------------------------------+----------
        18 |       958          2          1          1 |       962 
           |      0.41       0.38       0.19       0.20 |      0.41 
-----------+--------------------------------------------+----------
        19 |       955          4          4          1 |       964 
           |      0.41       0.76       0.74       0.20 |      0.41 
-----------+--------------------------------------------+----------
        20 |       951          3          3          2 |       959 
           |      0.41       0.57       0.56       0.40 |      0.41 
-----------+--------------------------------------------+----------
        21 |       968          1          2          3 |       974 
           |      0.42       0.19       0.37       0.59 |      0.42 
-----------+--------------------------------------------+----------
        22 |       892          2          0          0 |       894 
           |      0.39       0.38       0.00       0.00 |      0.38 
-----------+--------------------------------------------+----------
        23 |       955          0          2          2 |       959 
           |      0.41       0.00       0.37       0.40 |      0.41 
-----------+--------------------------------------------+----------
        24 |       881          0          2          3 |       886 
           |      0.38       0.00       0.37       0.59 |      0.38 
-----------+--------------------------------------------+----------
        25 |       941          3          2          1 |       947 
           |      0.41       0.57       0.37       0.20 |      0.41 
-----------+--------------------------------------------+----------
        26 |       913          1          3          1 |       918 
           |      0.39       0.19       0.56       0.20 |      0.39 
-----------+--------------------------------------------+----------
        27 |       893          2          4          2 |       901 
           |      0.39       0.38       0.74       0.40 |      0.39 
-----------+--------------------------------------------+----------
        28 |   202,784        472        471        449 |   204,176 
           |     87.62      89.22      87.71      88.74 |     87.63 
-----------+--------------------------------------------+----------
         . |       241          2          1          1 |       245 
           |      0.10       0.38       0.19       0.20 |      0.11 
-----------+--------------------------------------------+----------
     Total |   231,432        529        537        506 |   233,004 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |     1,080          1          6          1 |     1,088 
           |      3.76       1.79       8.96       1.72 |      3.76 
-----------+--------------------------------------------+----------
         1 |     1,133          0          3          3 |     1,139 
           |      3.94       0.00       4.48       5.17 |      3.94 
-----------+--------------------------------------------+----------
         2 |     1,087          1          2          3 |     1,093 
           |      3.78       1.79       2.99       5.17 |      3.78 
-----------+--------------------------------------------+----------
         3 |     1,052          3          3          3 |     1,061 
           |      3.66       5.36       4.48       5.17 |      3.67 
-----------+--------------------------------------------+----------
         4 |     1,018          1          3          1 |     1,023 
           |      3.54       1.79       4.48       1.72 |      3.54 
-----------+--------------------------------------------+----------
         5 |     1,065          4          0          2 |     1,071 
           |      3.71       7.14       0.00       3.45 |      3.70 
-----------+--------------------------------------------+----------
         6 |     1,013          0          2          3 |     1,018 
           |      3.53       0.00       2.99       5.17 |      3.52 
-----------+--------------------------------------------+----------
         7 |     1,019          3          2          4 |     1,028 
           |      3.55       5.36       2.99       6.90 |      3.56 
-----------+--------------------------------------------+----------
         8 |     1,020          2          4          2 |     1,028 
           |      3.55       3.57       5.97       3.45 |      3.56 
-----------+--------------------------------------------+----------
         9 |     1,026          3          0          2 |     1,031 
           |      3.57       5.36       0.00       3.45 |      3.57 
-----------+--------------------------------------------+----------
        10 |     1,022          4          2          1 |     1,029 
           |      3.56       7.14       2.99       1.72 |      3.56 
-----------+--------------------------------------------+----------
        11 |     1,031          3          4          1 |     1,039 
           |      3.59       5.36       5.97       1.72 |      3.59 
-----------+--------------------------------------------+----------
        12 |     1,001          1          3          0 |     1,005 
           |      3.48       1.79       4.48       0.00 |      3.48 
-----------+--------------------------------------------+----------
        13 |     1,055          2          5          2 |     1,064 
           |      3.67       3.57       7.46       3.45 |      3.68 
-----------+--------------------------------------------+----------
        14 |       975          1          0          1 |       977 
           |      3.39       1.79       0.00       1.72 |      3.38 
-----------+--------------------------------------------+----------
        15 |     1,006          3          0          4 |     1,013 
           |      3.50       5.36       0.00       6.90 |      3.50 
-----------+--------------------------------------------+----------
        16 |       919          4          2          4 |       929 
           |      3.20       7.14       2.99       6.90 |      3.21 
-----------+--------------------------------------------+----------
        17 |       964          1          1          2 |       968 
           |      3.35       1.79       1.49       3.45 |      3.35 
-----------+--------------------------------------------+----------
        18 |       958          2          1          1 |       962 
           |      3.33       3.57       1.49       1.72 |      3.33 
-----------+--------------------------------------------+----------
        19 |       955          4          4          1 |       964 
           |      3.32       7.14       5.97       1.72 |      3.33 
-----------+--------------------------------------------+----------
        20 |       951          3          3          2 |       959 
           |      3.31       5.36       4.48       3.45 |      3.32 
-----------+--------------------------------------------+----------
        21 |       968          1          2          3 |       974 
           |      3.37       1.79       2.99       5.17 |      3.37 
-----------+--------------------------------------------+----------
        22 |       892          2          0          0 |       894 
           |      3.10       3.57       0.00       0.00 |      3.09 
-----------+--------------------------------------------+----------
        23 |       955          0          2          2 |       959 
           |      3.32       0.00       2.99       3.45 |      3.32 
-----------+--------------------------------------------+----------
        24 |       881          0          2          3 |       886 
           |      3.07       0.00       2.99       5.17 |      3.06 
-----------+--------------------------------------------+----------
        25 |       941          3          2          1 |       947 
           |      3.27       5.36       2.99       1.72 |      3.28 
-----------+--------------------------------------------+----------
        26 |       913          1          3          1 |       918 
           |      3.18       1.79       4.48       1.72 |      3.17 
-----------+--------------------------------------------+----------
        27 |       893          2          4          2 |       901 
           |      3.11       3.57       5.97       3.45 |      3.12 
-----------+--------------------------------------------+----------
        28 |       941          1          2          3 |       947 
           |      3.27       1.79       2.99       5.17 |      3.28 
-----------+--------------------------------------------+----------
     Total |    28,734         56         67         58 |    28,915 
           |    100.00     100.00     100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==1&stop_ae_all==ae_all

  Analysis |
 time when |
    record |                    drug
      ends |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
        .5 |     1,080          1          6          1 |     1,088 
         1 |     1,133          0          3          3 |     1,139 
         2 |     1,087          1          2          3 |     1,093 
         3 |     1,052          3          3          3 |     1,061 
         4 |     1,018          1          3          1 |     1,023 
         5 |     1,065          4          0          2 |     1,071 
         6 |     1,013          0          2          3 |     1,018 
         7 |     1,019          3          2          4 |     1,028 
         8 |     1,020          2          4          2 |     1,028 
         9 |     1,026          3          0          2 |     1,031 
        10 |     1,022          4          2          1 |     1,029 
        11 |     1,031          3          4          1 |     1,039 
        12 |     1,001          1          3          0 |     1,005 
        13 |     1,055          2          5          2 |     1,064 
        14 |       975          1          0          1 |       977 
        15 |     1,006          3          0          4 |     1,013 
        16 |       919          4          2          4 |       929 
        17 |       964          1          1          2 |       968 
        18 |       958          2          1          1 |       962 
        19 |       955          4          4          1 |       964 
        20 |       951          3          3          2 |       959 
        21 |       968          1          2          3 |       974 
        22 |       892          2          0          0 |       894 
        23 |       955          0          2          2 |       959 
        24 |       881          0          2          3 |       886 
        25 |       941          3          2          1 |       947 
        26 |       913          1          3          1 |       918 
        27 |       893          2          4          2 |       901 
        28 |       941          1          2          3 |       947 
-----------+--------------------------------------------+----------
     Total |    28,734         56         67         58 |    28,915 

. tab fail_ae_all drug,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

fail_ae_al |                    drug
         l |   control  sotrovima   paxlovid  molnupira |     Total
-----------+--------------------------------------------+----------
         0 |   202,698        473        470        448 |   204,089 
           |     87.58      89.41      87.52      88.54 |     87.59 
-----------+--------------------------------------------+----------
         1 |    28,734         56         67         58 |    28,915 
           |     12.42      10.59      12.48      11.46 |     12.41 
-----------+--------------------------------------------+----------
     Total |   231,432        529        537        506 |   233,004 
           |    100.00     100.00     100.00     100.00 |    100.00 

. *check censor reasons*
. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==ae_all,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==death_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |         drug
      ends |   control  molnupira |     Total
-----------+----------------------+----------
         1 |        52          1 |        53 
           |     29.05     100.00 |     29.44 
-----------+----------------------+----------
         2 |        44          0 |        44 
           |     24.58       0.00 |     24.44 
-----------+----------------------+----------
         3 |        42          0 |        42 
           |     23.46       0.00 |     23.33 
-----------+----------------------+----------
         4 |        27          0 |        27 
           |     15.08       0.00 |     15.00 
-----------+----------------------+----------
         5 |        14          0 |        14 
           |      7.82       0.00 |      7.78 
-----------+----------------------+----------
     Total |       179          1 |       180 
           |    100.00     100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==dereg_date,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |        33 |        33 
           |     20.50 |     20.50 
-----------+-----------+----------
         2 |        45 |        45 
           |     27.95 |     27.95 
-----------+-----------+----------
         3 |        33 |        33 
           |     20.50 |     20.50 
-----------+-----------+----------
         4 |        30 |        30 
           |     18.63 |     18.63 
-----------+-----------+----------
         5 |        20 |        20 
           |     12.42 |     12.42 
-----------+-----------+----------
     Total |       161 |       161 
           |    100.00 |    100.00 

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==1,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==2,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,remdesivir_d,casirivimab_d)&drug==3,m col
no observations

. tab _t drug if fail_ae_all==0&_t<28&stop_ae_all==min(sotrovimab_d,paxlovid_d,molnupiravir_d,remdesivir_d,casirivimab_d)&drug==0,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Analysis |
 time when |
    record |    drug
      ends |   control |     Total
-----------+-----------+----------
         1 |        86 |        86 
           |     30.94 |     30.94 
-----------+-----------+----------
         2 |        93 |        93 
           |     33.45 |     33.45 
-----------+-----------+----------
         3 |        99 |        99 
           |     35.61 |     35.61 
-----------+-----------+----------
     Total |       278 |       278 
           |    100.00 |    100.00 

. 
. save "$projectdir/output/data/main.dta", replace
(file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/output/data/main.dta not found)
file C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/output/data/main.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\k1635179\OneDrive - King's College London\Katie\OpenSAFELY\Sotrovimab-Paxlovid-Molnupiravir/logs/cleaning_dataset.log
  log type:  text
 closed on:   2 May 2023, 11:22:44
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
